[
	{
		"institution_id" : 341,
		"description" : "The Desert Regional Consortium has made a concerted effort to address gaps in service areas by continuing to increase course offerings in the allowable program areas, reducing student barriers to education, and enhancing and expanding student services. This has been accomplished through partnerships and leveraging of resources.  \nAdditionally, the consortium has initiated strategies to address workforce oriented professional development, career centers, job developers, contextualized learning, articulations, pilots for orientation, intake, assessments, counseling and career pathways. These strategies have included our partners in the region that also supply workforce training and services.  As a result, relationships are developing with potential partners so that MOUs have been formed to leverage resources with agencies such as, Trade Union Apprenticeships, DPSS, County WIB, VA, DA and Tribal Nations.  \nThe DRC commissioned Resource Development Associates to undertake the creation of a Strategic Plan to determine specific needs and where to allocate future funding, programs and classes in the Coachella Valley. Data from the RDA Plan identified that less than 20% of adults over the age of 25 who live in the Coachella Valley Unified School District (CVUSD) have attended college or obtained an AA degree or higher. About ¼ of adults over the age of 25 living in the DSUSD and PSUSD regions have some college, but no degree.\nThe RDA Plan validated that there is a large disparity in educational attainment among individuals who live in the (CVUSD) region compared to the rest of the region. DSUSD and PSUSD are closer to the County (20%) and State (18%) rates. The majority (79%) of residents in the CVUSD region speak Spanish. Whereas, many of residents of the DSUSD (62%) and PSUSD (60%) regions speak English.\nThese insights validate expenditures in the East valley and as more data emerges it will indicate where to concentrate additional funding.\nAEBG allocations are managed by the Desert Regional Consortium and are used to maintain principals of inclusion, transparency, collaboration, and equality, while building capacity to develop and implement systemic approaches for adult learners to achieve their academic and career goals. The DRC is an incubator for not only exchanging ideas, working with external partnerships, leveraging resources between members to eliminate gaps, but as a collaborative, as members work with each other as true partners beyond DRC meetings."
	},
	{
		"institution_id" : 364,
		"description" : "Working together with all eight NOCRC Members and numerous Partners throughout the 2017-18 implementation year, NOCRC stayed true to its stated Regional Comprehensive Plan (RCP) vision of Rethinking and Redesigning Adult Education…Together.  \nThe ideas of innovation, integration, and seamless transition drove the AEBG implementation strategies in 2017 – 2018. By partnering with the Love & Logic Institute, the consortium added two new sets of curriculum, Love and Logic: Supporting Youth with Challenging Pasts ® (trauma-informed practices) and Love and Logic: Supporting Youth with Special Needs ®.  Once approved by the CCC State Chancellor’s Office, the curricula will be offered as noncredit apportionment courses thus releasing AEBG funds for other needs of the consortium. \nAs NOCRC plans for the fourth implementation year, its members identified successful strategies to be continued or expanded, the strategies with great potential but requiring modification and new strategies to be piloted or fully implemented. For example, ESL Mentorship strategy at the Fullerton College will be replicated at the Cypress College. Additionally, DSS Workgroup is designing a peer mentorship program for students transitioning from K12 to community college. New Regional Workforce: Collaboration & Development strategy will create a framework to align WIOA, Strong Workforce, and NOCRC Regional plans. The previous Workforce Development and Career Pathways strategy will be integrated into the existing CTE: Program Development, Pathways, Outreach, & Student Support strategy to eliminate duplication of efforts and to provide holistic career services.    Based on the regional need for high school diploma or its equivalency, Basic Skills Workgroup approved a high school equivalency direct instruction strategy utilizing a cohort model combined with additional skill development outside the classroom. \nIn the upcoming year, NOCRC will deploy a comprehensive outreach and marketing plan, to boost brand awareness and move the needle on enrollment and retention. The plan will commence with a consortium-wide retreat to evaluate current community needs and marketing efforts and then create long-term strategies that would ensure the broadest reach.  The findings from the marketing plan research, will inform the 3-year NOCRC planning.\nIn summary, NOCRC will continue to Rethink and Redesign Adult Education in the 2017-18 implementation year.\n\n"
	},
	{
		"institution_id" : 342,
		"description" : "MISSION\nThe South Bay Adult Education Consortium serves and empowers all students to meet their personal, educational and career goals.\n \n\n VISION\nThe vision of the South Bay Adult Education Consortium (SBAEC) is to help adult learners in the South Bay reach their potential through pathways to higher education and employment.\n \n \nThe consortium has continued to develop and strengthen the processes implemented in 2016-17. The focus of the SBAEC consortium has been on creating seamless transitions to support students as they progress on their pathway to higher education and employment. New classes have been designed and staff development has focused on classroom instruction to help prepare students for career and higher education. Career pathways are being created to accelerate students along their path. El Camino College (ECC) and the adult schools have worked cooperatively to create classes and help students transition between programs. Funds were spent on technology for all programs to assist with online registration, testing, classes, and improved instruction.\n \n\nSELECTED 2017-18 ACCOMPLISHMENTS\n\n1. Created and rolled out the implementation of career pathways in business, automotive technology, advanced manufacturing as well as early childhood education.\n\n2.  Continued the work on articulated classes\n\n3. Accelerated ESL learning by classes focused on specific learning outcomes in reading and writing.\n\n4. Increased student access to technology and expanded the use of online classes.\n\n5.  Provided professional development in College and Career Readiness standards(CCRS) and English Language Proficiency Standards (ELPs) for Adult Learners.\n\n6. Improved data collection for consistency across the consortium.\n\n7. Used student service centers to identify and enroll students in college and career pathways.\n\n8. Held Career Fairs at the Adult schools for program awareness and transition support.\n\n9. Expanded the partnership with the One Stops to provide greater outreach to the community.\n\n10. Offered increase student supports to overcome adult education barriers to education.\n\n11. Increased student transitions to the workforce and college.\n \nGOALS FOR 2018-19\n\n1. Improve awareness and leverage the resources of the Consortium.\n\n2. Improve the seamlessness of students’ transition to post-secondary education and the workforce.\n\n3. Maintain and improve internal and external communication.\n"
	},
	{
		"institution_id" : 390,
		"description" : "Vision: The South Bay Adult Education Consortium/Southwestern is committed to an ongoing effort to strengthen and enhance adult learner access, persistence and success. Members offer well-aligned educational programs that provide the region's adults with equitable access to educational services that will prepare them for citizenship, for completion of a high school diploma or equivalent, to gain skills for high demand jobs, and to transition to postsecondary institutions and/or the workforce. Adult education includes programs designed specifically for adults with disabilities. \n\nAccomplishments of Prior Year:\n\n-Members provided ongoing AEBG noncredit and adult education courses. \n\n-Marketing plan implementation included modifications to the consortium website, development of a Twitter and Instagram account, and continued delivery of a Facebook ad.\n\n-SWC curriculum development resulted in over 20 new/revised courses and programs that will be offered to meet the needs of the community. Progress was made toward code alignment, needs assessment, the development of enhanced student services for noncredit students (assessment, orientation, education planning, and counseling), and toward the campus-wide effort to provide a noncredit ID card that allows noncredit students access to the following services: library, tutoring, Child Development Center childcare discounts, health services, Disabled Student Services, employment services, veteran services, student discounts in the community, and participation in student organizations.\n\nSUHSD served over 10,400 adult students in an array of high-need areas: ESL, Citizenship, ABE, HSD/HSE, and CTE. SUHSD restructured the Professional Learning Community process to focus on professional development around creating formative assessments, promoting completions, and improving internal consistency of curriculum implementation. Two staff release days were devoted to accelerate transition to AEBG alignment division-wide.\n\nPrimary goals for the upcoming year:\n\nTo maintain/increase the number of students served consortium-wide, SWC may offer new noncredit AEBG courses at adult school facilities, libraries, etc., and SUHSD may offer new adult ed courses at SWC facilities. \n\nStudent ed planning and goal setting will become an institutionalized process for all AEBG students.\n\nAdults with disabilities will receive the appropriate service based on their individual need.\n\nAll planned allocations are consistent with the 3 year plan.\n\n"
	},
	{
		"institution_id" : 374,
		"description" : "In keeping with the Collective Impact approach of having the region work together, the Inland Adult Education Consortium (IAEC) has kept the spirit of collaboration central in all decision making. The Regional Comprehensive Plan serves as a foundational plan for the Consortium toward the realization of the vision and goals keeping in alignment with the county’s vision of working together to create regional stability among adult education service providers. By partnering with community service providers including businesses, government and CBOs, the Consortium continues to work toward creating a comprehensive regional approach for students by providing tools and support for their progression along their educational career pathways.\n\n\nThe Consortium implementation of services during the 2017-18 program year was based on refinements to the Regional Comprehensive Plan, data from Member Districts, LMI data, and strategies designed to directly impact the unmet academic needs of adult learners living within the region. The Consortium leadership chose three priority areas for the 2017-18 program year, with the goal of addressing the largest gaps in program area offerings to adult students. The three priority areas were High School Diploma/High School Equivalency, Basic Skills and English as a Second Language. The Community College District continued successful programs that were previously piloted for non-credit basic skills math. In addition, counselor/transition specialists were hired to assist in transitioning students from both non-credit to credit coursework at the college and work with each Adult School to transition students to postsecondary pathways.\n\n\nIn the 2018-19 fiscal year, IAEC will embrace the opportunities to work regionally on the assessment and placement of students, use of student data in program design, address further gaps in services, and identify ways to support accelerated learning programs for students' academic pathways and/or career goals. IAEC will also expand the offerings of CTE courses across the region. The region will work together on continuing the implementation of a Consortium-wide professional development calendar and build additional relationships with more community partners to better leverage existing resources.\n"
	},
	{
		"institution_id" : 351,
		"description" : "In 2018-19 we plan to continue expanding opportunities for adult learners in our region by broadening access to career and technical education programs for adults through the use of the facilities at LTUSD in collaboration with the other members of the consortium to include focus on skilled jobs in the basin such as auto/diesel mechanics, additional culinary offerings, and explore construction and small engine repair. We will continue to increase our ability to \"transport\" these offerings to Alpine County to reduce the travel burden of residents, including members of the Washoe tribal community. This expansion of CTE services will also support adults working toward a high school credential by offering more opportunity for relevant learning that not only has value toward HS completion but provides career ready job skills. At the post-secondary level, efforts will continue to broaden access for non-traditional students, including explicit outreach around the Tahoe Promise program (first time, full-time tuition free year) as well as expand offerings on the ETPL, increase pre-apprenticeship engagement (while establishing a registered culinary apprenticeship with the State), and expand offerings and support for ESL and basic skills students."
	},
	{
		"institution_id" : 361,
		"description" : "Serving nearly 42,000 students in 2017-18, Mt. SAC Regional Consortium is bounded by the service area of Mt. San Antonio College. The members include Baldwin Park Adult and Community Education, Bassett Adult School, Charter Oak Adult School, Tri-Community Adult School (Covina-Valley USD), East San Gabriel Valley Regional Occupational Program, Hacienda La Puente Adult Education, Mt. San Antonio College – School of Continuing Education, Pomona Adult School, and Rowland Adult and Community Education. Completing the third year of the initial 3-year planning cycle, the consortium is on a confident path for our primary vision of aligning services, leveraging resources, transitioning students to employment and post-secondary institutions, and accelerating progress of adult students. \nThe key goals of the 3-year plan are:  Program Growth, College and Career Pathways, Course Affordability, Expanded Course Schedules, Online and Distance Learning, and Improved Student Services.  \nOver the past three years, progress has been made towards these goals. For the first two years, the perception that adult education allocations were considered a “grant” and not ongoing funding affected some schools’ ability to staff operations and deliver services. We have made strides in the areas of data collection and reporting, post-secondary pathway transitions, and placement with state employment agencies and partners. \n2017-18 Progress: \nMajor regional needs identified in the 2017-18 plan focused on addressing the regional gaps in the core educational areas of English as a Second Language, Adult Basic/Secondary Education, Career Technical Education, and Adults with Disabilities population. Work groups are established in these service areas along with Counseling Student Support Services, Adults Training for Child School Success, and Data Accountability. The goal of moving students along established pathways is also under planning and development in the respective work groups along with addressing student barriers.\nPrimary Goals for 2018-19: \nConsistent with the current 3-year plan, the Consortium will continue to focus on the goals and activities outlined in the 2017-18 plan, noting that some campuses have already reached program capacity with existing funds. Continued focus will be on:\nStaff professional development related to instructional improvement, Student acceleration, transitions to post-secondary and employment, Student outcomes, Data collection, and Member Effectiveness."
	},
	{
		"institution_id" : 393,
		"description" : "Consistent with the Three Year Plan Submitted in March of 2015, the VVAERC continues to implement a multi-layered, multi-year approach to streamline assessments and curriculum between the K-12 systems, and to enhance, restore, and institute additional Adult Education Programs across all member districts. The Three Year Plan continues to serve as the foundation for the development and implementation of the Regional Consortium’s 2018-19 Annual Plan, vision, and goal to stabilize and improve adult education services in the region. The VVAERC will seize the momentum backing workforce preparation programs and harnesses the passion of local school administrators to turn attention toward adults needing  basic and secondary education skills, Adults with Disabilities, and those who would benefit from ESL programs to tie into a road-map for employment success. \nIn 2017-18, the VVAERC's rural member district reestablished adult education instructional services. Member Districts with established Adult Education Programs expanded capacity and increasing CTE course offerings. \nIn the 2018-19 program year, the VVAERC will focus on addressing gaps in service and seamless transition while striving to strengthen the relationship with community partners in order to leverage existing resources. Counseling services will continue to be provided by Victor Valley College to each Member district in facilitating the transition from adult school to community college and/or the workforce. VVAERC envisions providing a focused transition service plan, region wide, as a measurable initiative, where by administrators will be able to track student success to a greater extent than is now possible. VVAERC commits to exploring options to increase the rigor and credibility of all programs across the Consortium.\nHSE/HSE and ESL services and additional NRS levels have been expanded across member districts. Integration of ESL strategies into ABE/ASE/HSE/HSD curriculum will afford a streamlined instructional approach. Three member districts were newly awarded WIOA II grant funds during the 2017-19. College CTE courses have been articulated to include adult schools and will be offered at select sites in the 2018-19 year. VVAERC hosted the first annual joint Adult Education Commencement Ceremony at VVC where all districts participated. Member Districts participated in the shared delivery of professional development across the seven program areas with other consortia in the San Bernardino region. "
	},
	{
		"institution_id" : 331,
		"description" : "The Butte Glenn Adult Education Consortium helps adults learn the basic academic and work readiness skills needed to become employed and increase their career opportunities.  Through our network of participating school districts, educational providers, workforce development, and human services organizations, we connect adults in Butte and Glenn Counties to educational programs that meet employer needs, enabling our students and our region to grow and thrive.  During the 16-17 fiscal year the consortium grew its ABE, ASE, Basic Skills and ESL offerings to under-served location by opening a new location in Chico, CA and expanding it's HSD/GED program in Paradise, CA.  The consortium grew its shorter term CTE offerings to include construction pre-apprenticeship, forklift training, and expand health occupations, all leading to jobs for students.  In 17-18 and now 18-19 the consortium will continue to maintain the growth markets that it implemented on inception of the consortium.  \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n"
	},
	{
		"institution_id" : 345,
		"description" : "ACES vision is for consortium member agencies to work in sync with one another to provide adult education instruction and services in accordance with the evolving needs of our service area.  Services will target communities that are traditionally underserved.  Students entering the adult education system will be welcomed, supported and will move seamlessly through educational, training, and career placement opportunities.  \nThe consortium accomplishments included: \nProviding previously unavailable services in enrollment, counseling, learning disability intakes, assessment/data, and childcare.\nDevelopment of map and marketing materials for the vocational pathways for students from HS to CC.  \nDramatic increase (from 5%-26%) in student transitions from community to college ESL.\nFor professional development, several day long mental health workshops, a 3 day professional development symposium, a first super-regional professional development day, and biannual lesson sharing events were offered. \nEstablished partnerships to develop and offer new training classes and provide classes for students transitioning out of county jail. \nConsortium goals 18/19:\n•\tConduct more intensive-targeted marketing to reach underserved populations.\n•\tIncrease vocational training and programs. \n•\tProcure another fulltime counseling position for a consortium member\n•\tImplement in-reach marketing for K-12 vocational students.  \n•\tProvide mental health support for Morgan Hill Adult Education students\n•\tDevelop a system for securing accommodations for learning disabled student taking the HiSet.  \n•\tConduct regular meetings with consortium staff who provide student support. \n•\tOrganize regular meetings for all consortium counselors \n•\tRedesign ESL curriculum to further accelerate students through developmental sequence.  \n•\tMap and make systematic the offering of student support services throughout the ESL course sequence.  \n•\tProvide Math bootcamps at the Morgan Hill Adult School and explore possible collaboration of lower level Math classes at the adult school.  \n•\tProvide professional development opportunities across the consortium and in tandem with the super region.  \n•\tPromote development and expansion of jail course offerings and presence at the transition center to accelerate learning and to transition students effectively and efficiently. \n\n These goals take into account roles and activities that have been ongoing and that are logical extensions of current practices.\n\n \n \n    "
	},
	{
		"institution_id" : 389,
		"description" : "The South Orange County Regional Consortium (SOCRC) will continue to build on the strong momentum its members have achieved from its three year plan in 2018-2019. The members will continue to maximize the impact of their allocations in alignment with this plan and the three year plan.  Our vision to to continue our outreach and programs to local communities to engage Adult Education Students across the region.  Efforts are being focused on increasing the retention of AEP students and their successful completion of coursework in AESL, CTE and general education curriculum classes.  We are now offering students a variety of class modalities across the region including onsite, online and hybrid platforms.  Our data and accountability cohort study research indicates that the two strongest barriers to course completion for our AEP students are transportation and family obligations.  Offering courses in a hybrid format at our sites directly addresses these two barriers to student success.  We are also expanding our locations:  at Tustin Unified School District (TUSD), faculty are offering classes at a One Stop Center at the Orange County Family Resource Center in Irvine with another SOCRC Partner, the Irvine Unified School District. The majority of our sites have added more pronunciation and conversational classes in response to student surveys.  Our community college partners continue to expand our portfolio of classes for Adults with Disabilities (AWD).  We are also enhancing our Career Technical Education in the areas of Pharmacy Technician, Surgical Technologist and Dental X-Ray Assistant in partnership with California Career Advantage.  Our resource allocations reflect these efforts and are consistent with our three year plan.  The result is that our AEP students invest a short period of time in a class and are then job ready within six months.  Our Capistrano Adult Education site has worked with local doctors, hospitals and pharmacies to ensure that AEP students are placed quickly and effectively into these jobs.  The Surgical Technologist and Pharmacy programs articulate with courses that begin at the high school level.  We ask the full-time faculty at Irvine Valley and Saddleback Colleges to collaborate with the SOCRC so that we may dovetail with other program efforts such as Strong Workforce and Guided Pathways, supporting and not supplanting each other's resources.  We continually assess our ability to address the five program areas under the program."
	},
	{
		"institution_id" : 358,
		"description" : "Based on our needs, the Gateway Adult Education Network’s (GAEN) three-year adult education plan includes building our Adult Basic Skills courses and programs, increasing opportunities for Adults with Disabilities, and collaborating with local partners to increase our CTE courses and programs. Lastly, there is a need to increase student numbers across all Consortium members.\n\nThe GAEN community partners for 2017-18 included Merced and Mariposa County Workforce Investment, Human Services Agency, California Department of Rehabilitation, Merced County Adult Literacy Program, Mental Health, local labor union representatives, Central Valley Opportunity Center, and Kings View Work Experience Center. In 2018-19, more information will be gathered from local employers and organizations as the consortium works toward Career Technical programs leading to industry-recognized certification.\n\nThe majority of the member districts in GAEN will offer ESL to enhance adults’ proficiency in English and allow them to advance in their careers as well as connect with their children in a school setting. The classes will all be delivered to elementary schools, high schools, community colleges, and partner organizations. Also, at some of the schools, there will be classes for adults who wish to prepare for their GED Exam, complete their high school diplomas, or earn an equivalency certificate. Merced Adult School operates a testing center for both the GED and the HiSET tests. Merced College provides preparation classes for the GED Exam and refers students elsewhere for the actual testing, such as the Merced Adult School.\n\nBuilding services for Adults with Disabilities and pre-apprenticeship courses will be a high priority for 2018-19. Unfortunately, services to Adults with Disabilities in the Merced County area are fractured, and the task of partnering to provide student support has been explored, but it has been thwarted by the lack of cohesiveness in the field as a whole. \n\nTo increase student program numbers, we will invest in marketing strategies, which include the use of large banners, a regional adult education catalog, radio interviews, flyer distribution throughout Merced and Mariposa counties’ elementary schools and community organizations, open house-style orientations, and word-of-mouth to attract students throughout the area region.\n  \nRealistically, for the next year, most of the districts in the consortium will continue to work on developing lasting programs. "
	},
	{
		"institution_id" : 337,
		"description" : "In 2018-19, the Consortium’s primary focus is to expand the strategies that have started, begin implementation of those that have yet to be launched and incorporate selected new programs and strategies to make progress towards the realization of the vision and goals of the Consortium. Specifically, the Consortium will:\n- Implement a comprehensive marketing and outreach plan \n- Expand co-enrollment in basic skills and CTE courses for integrated education training\n- Work on CTE pathways and curriculum alignment\n- Enhance the technical infrastructure, processes and systems needed to support the orientation, assessment, academic and career advising, and tracking of students transitioning from the adult education schools to community colleges\n- Continue offering and refining the adult education program supported courses and programs to support the needs of the Adult Education students and local community.\n- Enhance the outreach and transition support program for adult education students from the Adult Education Schools to community colleges\n- Continue the work related to curriculum, competency and assessment alignment\n- Provide professional development to support the improvement of the grant programs and achievement of grant objectives\n- Continued collaboration of regional partners to leverage existing structures\n"
	},
	{
		"institution_id" : 334,
		"description" : "The Mid-Alameda County Consortium (MACC) envisions all adults in its region having a clear pathway toward attainment of personal and career goals through seamless delivery of instructional, training and support services. Its three-year and annual plans seek to build and leverage the necessary supports for student goal attainment. Contributing to that end are 2017-18 accomplishments such as:\n1.\tintegrating community agencies providing key student supports into the Community Pro Suite data/referral system\n2.\tsponsoring a cross-regional conference for teachers, classified staff and administrators\n3.\ta cross-system understanding of ESL student readiness for college coursework and a plan for developing a related assessment\n4.\tthe emergence of contextualized and IET curricula\n5.\tcommunity college open houses and class visits promoting student transition, including El Centro, the one-stop resource center at Chabot College \n6.\treformed strategy teams, now called work teams, operating with more concrete goals\n7.\ta new website providing information to the public and functioning as a communication hub for MACC participants\n\nWhile the 2018-19 annual plan calls primarily for the maintenance of current programming, it also addresses growth and expansion within the limitations of funding that is outpaced by rising operational costs and reductions in WIOA funding. 2018-19 allocations were proportionally nearly identical to those of 2017-18, with slight variations in COLA distribution supporting limited growth led by members receiving higher funding. \n\nIn 2018–19, MACC will build on recent accomplishments and move toward greater integration of programs and services by:\n1.\tadding classes in ESL and Citizenship\n2.\toffering new CTE courses (including programs for students with disabilities). \n3.\tincreasing the integration of contextualized instruction and integrated education and training \n4.\tstrengthening the capacity and coordination of Transition Specialists\n5.\tnurturing the partnership with the Alameda County Workforce Development Board by prioritizing integration of the AJCCs into Community Pro Suite \n6.\tshifting from from planning to implementation of Community Pro Suite\n7.\tshowcasing services and cultivating community interaction via the recently-launched web site. \n\nFinally, the MACC looks forward to developing the new three-year plan as an opportunity for assessing process and product to date and for refocusing its collaboration for greater student goal attainment."
	},
	{
		"institution_id" : 347,
		"description" : "We are focused on Education That Works/Transitions That Matter, further implementing and expanding an innovative, aligned system that supports the communities of East San Diego County.  Our members have been embracing change, and ERAE students have noticed the changes: They can choose from several learning pathways with multiple entry and exit points; experience more career and college contextualized education in the classroom; and have access to holistic, personalized transition and support services that often start even before they are registered for specific classes. Education That Works/Transitions That Matter means expanding effective and ‘just-in-time’ learning opportunities that meet the diverse and changing needs of our adult students in an agile manner; it means alignment of efforts for equitable career pathways that support all students in reaching their full potential. \n-We designed a model for non-academic and personal support services available to all students in all consortium programs. All students entering consortium programs connect with a transition specialist through a medium of their choice; all students can meet with a college admissions and career counselor once a week; and all students have the option to participate in monthly, targeted college & career field trips. \n-Through braided transition and student services, we supported 81 students in matriculating directly into credit-bearing, transferable college courses. Advocacy on behalf of our adult students led to eligible students being accepted into College Promise programs.\n-GAE signed an articulation agreement with Grossmont College for “Medical Terminology.” The Health Occupation Center consistently delivers high-quality training with a completion and certification rate of > 87%.\n-We aligned academic calendars across consortium members. This provides students with an additional opportunity to access supplemental classes. The alignment affords consortium members opportunities in joint professional development.\n-Outreach efforts and successes include a social media presence with more than 300,000 Twitter connections and more than 450,000 instances of LinkedIn engagement. We will:\n-Develop 2 career pathways in the Mt. Empire region;\n-Streamline matriculation & development of pathways to increase the number of students who acquire certificates, or specific skills for in-demand jobs;\n-Continue Adult Ed workgroups as part of college presidents’ leadership council;\n-Strengthen curricula"
	},
	{
		"institution_id" : 386,
		"description" : "The mission of our consortium is to leverage the strengths of members and partners to deliver outstanding adult education programs and services with seamless transitions into the workforce or postsecondary education.  In the past year, we’ve supported our mission through the following activities and efforts:\n\nRoseville Adult School has:\nLaunched a Clinical Medical Assistant class.\nAdded HiSet Testing and preparation\nLaid off two ESL teachers\n\nNevada Union has:\nCompletely remodeled curriculum and delivery for:\nAdded a 0.4 FTE guidance counselor \nDeveloped multiple CTE pathways for our Integrated EL Civics program\nThe Wayne Brown Correctional Facility program has been revamped \n\nSierra College has:\nDeveloped noncredit, tuition free* ESL pathway providing certificate of competency & clear transition/entry point to postsecondary\nFunded classroom supplies/dictionaries for ESL Bridge Program\nFunded prof. dev./release time for faculty to develop free instructional materials for students\nDeveloped additional noncredit*CTE courses: Construction,Energy Tech, Customer Service/ Business soft skills, Computer Skills.\n\nPlacer School for Adults has:\nOpened a regional Career Center and new campus \nLaunched new pathways (IET) and new satellites\nIncreased collaborations with local partners\nProfessional development in: Google Training, Passport to Student Wellness - Wrap-Around Services, CALPRO Accelerated IET Training \n\nTahoe Truckee Unified has accomplished the following:\nOffering a Pathway to Citizenship course\nAdded summer classes\nBuilt a new GED testing center\nOffered our first Blockly Coding workshop\nDeveloped several new partnerships to add capacity\nIncreased enrollment from 232 to 414 (up 78.4%).  We saw this increase due to the expansion of variety of program offerings, increasing from 38 offerings to 56. \n\nConsortium wide, we served over 16,000 students which is approximately 30% more students than the prior year.\n\nOn the mission/progress we’ve made in past year, primary goals include: \nWork with industry partners to expand career training opportunities\nIdentify counseling and support services that help eliminate barriers to completion \nAddress the wait-lists for our urban/more populated areas and expand our reach to rural and smaller regions within the consortium using technology and leveraging resources. \nMore specifically address students with disabilities throughout our programs. \n\n"
	},
	{
		"institution_id" : 349,
		"description" : "Imperial County Adult Education Consortium (ICAEC) members continue to collaborate and set common goals to provide adult learners access to high quality educational opportunities that appropriate and accessible.  ICAEC members met regularly to review past/best practices, including graduation requirements, manage funds and make decisions to benefit adult learners across the county.  Services have increased across the county and collaboration between members continues to strengthen. As a result, ICAEC has accomplished the following in the 2017-18 school year:  \n•Increased courses and class offerings in the areas of ESL, HSE, HSD\n•Increased enrollment in Adult Education programs\n•Expanded services from Student Success Specialists\n•Ongoing implementation of Pre-Employment Skills workshops \n•Ongoing implementation of data systems: ASAP, CASAS and TopsPRO \n•Ongoing implementation of a collaborative marketing plan\n•Developed and implemented a system to refer adult learners to programs\n•Ongoing implementation Data and Accountability funds to collect accurate data\n•Provided PD opportunities to adult education teachers and staff; IC AEBG Summit Annual Conference\n•Ongoing implementation of GED and HiSET Testing Centers\nThe goals of the ICAEC for the 2018-19 school year are as follows:\n•Increase the number of High School Diploma and High School Equivalency completers\n•Continue to increase the number of course and class offerings to provide accessibility throughout the day/evening\n•Continue to provide courses to assist adults learning English to support their children in school, and/or gain/advance employment and education opportunities and acquisition of US citizenship\n•Continue to refer adult learners to training centers and postsecondary options\n•Increase offerings for ESL students to learn skills to obtain employment or open small businesses; Culinary Arts Pathway, Healthcare Pathway, Welding \n•Implement instruction in the area of EL Civics to understand and navigate governmental, educational, workplace systems and key institutions, such as banking and health care\n•Implement basic computer skill classes ; internet, social media, word processing for resumes and job applications\n•Increased collaboration with IVC and other community agencies for career education and pathways•Establish connection to Arizona Western \n•Connect with Arizona Western Community College to increase access to postsecondary options for adult learners who reside on the Arizona/California border"
	},
	{
		"institution_id" : 372,
		"description" : "For the past four years RHRAEC has served thousands of adult students as they pursue education and career success and will continue to do so.  Although there have been many reductions in funding due to district demands such as union negotiations, facility needs and expansion and growth, RHRAEC continues to work together leveraging resources and supporting each member agency.  \nRHRAEC holds monthly public meetings to share information, include stakeholders input and support each other in expanding and improving services to adults in the region.  From 15-16 through 17-18 RHRAEC has expanded instructional hours, added programs and increased counseling services to better serve adult students.  RHC has provided counselors at member agencies which has resulted in adult students enrolling in the community college. This practice will continue.  RHRAEC has and will continue to hold professional development in alike departments, creating a venue for sharing curriculum and best practices; always with adult student success in mind.  \nThe successful day-long tour of member agencies held in 16-17 will be implemented in 18-19 to continue to inform counselors, new staff, and stakeholders of RHRAEC programs and services offered.  These tours also increase leveraging of services and bring dialog of gaps in services as well as regional needs. \nRHC will continue to offer and increase classes on the adult school campuses.  These classes are well received and an excellent way to introduce adult students to higher education creating seamless transitions.  Articulation agreements are a priority for 18-19.  RHC has committed to facilitating articulation agreements with the RHRAEC member agencies.  CTE courses are continuing to be added, reviewed and aligned for pathways to ensure adult student success.  Tri-Cities ROP has been approved to begin a CNA program.  EMRAS has begun its construction program and is investigating logistic and manufacturing programs which industry advisory partners are requesting for immediate employment.  WAS has added an Introduction to Construction Fundamentals class.  EMRAS and RHC are developing a referral protocol to eliminate EMRAS’s ESL Wait List of adult students.  RHRAEC members continue to hold advisory meetings, review labor markets and dialog with business industry partners for regional employment needs. \nThe 4.1% COLA was instrumental in maintaining most programs and was much appreciated.  "
	},
	{
		"institution_id" : 354,
		"description" : "The Los Angeles Regional Adult Education Consortium (LARAEC) identifies providing student integrated education and training (IET), implementing counseling services, offering inter-district professional development, and leveraging resources as critical components of its strategies to address existing gaps. LARAEC Regional Consortium Plan (RCP) points to these elements as key tools to assist learners in transitioning to post-secondary programs and the workforce. These components clearly align with the AEP legislative objectives and the three overarching strategies of LARAEC’s RCP:  1. Defining Bridges and Pathways, 2. Developing Student Supports and, 3. Delineating Common Accountability Systems.  \n \nLARAEC’s key accomplishments for last year (2017-18): 1. Conduct 59 pilots, with final pilot outcomes report to be reviewed in fall of 2018, 2. Provided inter-district professional development, including Communities of Practice, Professional Learning Communities, and IET training, 3. Outlined 20 CTE career pathways, 4. Developed the Quick Reference Guide for Counseling, 5. Created a web-based community resource guide and 6. Aligned K-12 ESL course outlines.  \n \nThe Consortium hosted the second annual LARAEC conference. This conference had over 550 registered, offered 32 professional development workshops, 24 adult education vendors, and welcomed multiple stakeholders, partners and guests from other consortia.  \n \nNext Steps for LARAEC Include: 1. Create CTE pathways that articulate adult schools and community college, 2. Create a transition plan to post-secondary to be implemented across USDs for on-boarding to community colleges or to employment, 3. Develop a LARAEC inter-district professional development plan with input from all member districts, 4. Incorporate technology-supported instruction across all districts, 5. Support at least one IET program in each district, 6. Collaborate with the Los Angeles Public Library (LAPL) to expand LAPL services to all LARAEC students, and 7. Increase targeted collaboration between WorkSource Centers and America’s Job Centers of California to provide co-location, transitions, and support that lead to adult education students’ employment .\n"
	},
	{
		"institution_id" : 357,
		"description" : "Mendocino Lake Adult and Career Education's (ML ACE) mission is to collaborate and share resources across historical and\ninstitutional boundaries to provide adults in our region seamless and integrated educational and career pathways and\nservices with multiple opportunities for successful entry and exit. Our three year plan describes the creation of these\nseamless and integrated pathways which have occurred or will occur in multiple ways.\nIn 2017-18, ML ACE held a successful \"Curriculum to Career Summit\" that included member agencies faculty, support agencies that offer services to our adult population, college CTE instructors and industry representatives from three high growth industry sectors in Mendocino and Lake Counties.  Outcomes from the summit led to the piloting of a 21st Century Soft Skills workshop, which was offered to adult & career education students in Mendocino & Lake Counties, in collaboration with our local WIOA supported agency. Another outcome from the summit was the revision of a healthcare pathway mapping guide to include student support services which was then widely distributed to all agencies in our counties.  \nIn 2017-18 ML ACE continued to fill gaps in services in the region by adding a new member and implementing new high school diploma programs in Round Valley and Willits and adding classes for HiSet prep and ESL in Ft. Bragg and Round Valley.  In the area of seamless transitions and accelerated learning, a certificate program was developed and implemented for Adults with Disabilities at Mendocino College.  For professional development, we participated in regional data and accountability workshops, webinars and presented at the AEBG annual summit.  \nIn 2018-19 ML ACE will work to expand classes at agencies by offering more high school equivalency test prep courses, basic computer skills (non-credit) courses, and home health aide and in-home care provider courses.  ML ACE will continue to work with local workforce agencies to implement a common referral system and will hold our 2nd Annual Curriculum to Career Summit to complete the rapid asset mapping of our identified industry sectors.    We will continue to work with industry partners to explore more offerings in healthcare and construction.  We will expand our transition services at adult school locations with the addition of a student success coordinator.  \n"
	},
	{
		"institution_id" : 392,
		"description" : "The mission of the Ventura County Adult Education Consortium (VCAEC) is to increase access, equity, and learner success for all adult students within its service area. VCAEC's overarching goals are to (1) Expand adult education programs and services to meet the needs of previously underserved areas; (2) Develop, enhance, and refine comprehensive counseling and support services to ensure student success; (3) Align and articulate courses, programs, and services to provide academic and career pathways, (4) Improve integration of services and programs to provide seamless transitions into regional education and career opportunities. Key accomplishments include: • Served over 10k students in AEBG instructional programs. Increased enrollments by over 14% and saw gains in awards of HSDs / HSEs (54%), most of whom are ELLs; increased post-secondary credentials (30%), wages (20%); and entrance into employment (9%). Particular growth was seen in Fillmore, which more than doubled its enrollments (108%). VACE showed an impressive 90% CTE job placement rate • Created public CASAS data dashboard with drill-downs by agency and year (https://www.vcaec.org/casas.html) • Expanded programs ESL / EL-C, parent-education programs in previously underserved areas of El Rio, Fillmore, Santa Paula, Ojai, and Moorpark • Successfully implemented new HSD/HSE programs in Santa Paula, Ojai, Moorpark, and Fillmore, whose Learning Center model incorporating direct instruction in ABE yielded significant increases in enrollment, retention and student achievement and drove program expansion to include new HSE-Spanish classes and intensive job development programs • Developed new and expanded existing partner relationships with the Strong Workforce Apprenticeship Group (SWAG), AJCC, Oxnard Elementary, the City of Oxnard-City Corps, library systems, and Todd Road Jail, among others • Successfully piloted IET programs in Hospitality, Paraeducator Training, and Machine Technology, with aligned pre-apprenticeship programs in machining and welding, and provided additional ENCORE Workforce (Re)Entry programs in Ventura. The above reflects a handful of the achievements made possible by listening to students, employers, partner agencies and other stakeholder groups in and around the Ventura region community. These collaborations have greatly enhanced VCAEC's overall capacity to empower and engage adult learners, better prepare them to achieve their goals and make a positive impact in our community. "
	},
	{
		"institution_id" : 343,
		"description" : "In keeping with the Collective Impact approach of having the region work together, the Feather River Adult Education Consortium (FRAEC) is moving forward with the spirit of collaboration central in all decision making. The Regional Comprehensive Plan submitted in March 2015 serves as a foundational plan for the Consortium toward the realization of the vision and goals keeping in alignment with the region's vision of working together to create regional stability among adult education providers. FRAEC is committed to working with businesses, government agencies and educators, to ensure the development of a comprehensive, regional approach for adult learners by providing the necessary tools and support for their progression along their educational and career pathways.\n\n\nFRAEC recognizes the need to shepherd adult learners through the continuum of services offered in and region to have a positive impact on educational attainment and overall economic development. Recognizing the missteps of prior years, the 2018-19 Annual Plan reflects a reset for the FRAEC and a full embrace of the AEP guidelines, opportunities to work regionally on the assessment and placement of students, use of student data in program design, the need to address gaps in services, and identification of ways to support accelerated learning programs for students' academic pathways and/or career goals. \n\n\nFRAEC is committed to providing formal direct, blended, and distance learning instruction via Plumas County Office of Education instructors across the AEP Program Areas. The FRAEC Members will work together on creating a Consortium-wide professional development calendar and build opportunities to meet the needs of rural areas through distance learning and collaborative instructional strategies.\n\nFor the 2018-19 Fiscal/Program Year, Plumas County Office of Education will serve as the Fiscal Agent, and will manage and monitor all programs offered through the California Adult Education Program. "
	},
	{
		"institution_id" : 359,
		"description" : "The Coastal North County Adult Education Consortium (CNCAEC) has been striving to increase and improve the adult education opportunities for residents of the north San Diego County region. In recent months the CNCAEC has undertaken a self-evaluation process to identify areas of improvement and create a more robust structure to achieve the intentions of the AB86 legislation. In that process, we recognized that we, as a Consortium, do not have a clearly defined vision and we will incorporate that into our next 3-year planning process to ensure we align our plan with the values of the CNCAEC members. The CNCAEC is proud of the work that has been accomplished in this past year. We have expanded our class offerings with adult education opportunities now available in all six of our region cities: Cardiff-by-the-Sea, Carlsbad, Carmel Valley, Encinitas, Oceanside, and Solana Beach. This expansion has resulted in an increase of locations by 61.5%, courses offered has increased by 29%, and the number of students served has increased by 35.9%! The career services specialist has continued working in classrooms with groups of students, coordinating job fairs and related events, and has provided job coaching to 87 individuals with several of those students now gainfully employed. This year we were also able to offer child care services for our students at three different locations with over 100 students accessing this benefit. In student focus groups we learned that for several of our students, this service made it possible for them to attend classes in the MiraCosta College Adult High School.  The primary goals for the coming year are to increase support services to all students, particularly at offsite locations and evening/weekend classes; establish a GED testing site to serve the region; improve opportunities for adult education students to transition to college or employment; and continue development of IET programs that contextualize basic skills or ESL into career education programs. The sole education provider in the CNCAEC, MiraCosta College, is implementing a new structure in support of AEBG that will be faculty-driven to ensure that strategies identified in the plan are achievable. The workgroups have already identified 15 areas from the original plan that still need attention, and those areas are aligned with the goals of the CNCAEC’s plan. "
	},
	{
		"institution_id" : 370,
		"description" : "The Rancho Santiago Adult Education Consortium’s (RSAEC) implementation plan for the 2018-2019 year is to continue with the goals set forth in the Regional Comprehensive Plan (RCP).  RSAEC’s 2017-2018 accomplishments include: \nThe Department of Rehabilitation co-located at Santiago Canyon College Division of Continuing Education (SCC-DCE) and the Santa Ana Work Center co-located at Santa Ana College School of Continuing Education (SAC-SCE). This leveraging of resources allows RSAEC to better serve students in the areas of job placement resources and training.\nIn fall 2017, SCC-DCE opened its Adults with Disabilities program, which focuses on workforce preparation. In 2017-18, student headcount reached 110 students. SCC-DCE grew from 0 classes offered to 14 classes offered with a total enrollment of 378 students with 22 CDCP certificates awarded.\nSAC-SCE opened the Remington Adult Education Center with full wrap-around services and programs in ESL, HSE, CTE and Pre-Apprenticeship. \nSCC-DCE created new CDCP Certificates to form pathways, which will lead to high-demand, high-wage employment.  These certificates include 3D Printing & Advanced Manufacturing, Digital Marketing, Home-Based Business and Certified Nurse Assistant. \nSAC-SCE offered its first pre-apprenticeship CDCP certificate in construction that included partners from industry, trade unions and workforce development.\nGarden Grove Adult Education (GGAE) revised ESL exit exams to be based on competency and allow students to be evaluated mid-year so that they can seamlessly promote to the next level.\nGGAE, SCC-CE and SAC-SCE completed a 2-year ESL curriculum alignment project. The new curriculum allows students to transfer seamlessly between programs and allows for consortia-wide curriculum collaboration and professional development.\nGGAE and SAC-SCE successfully piloted a noncredit CTE course on GGAE’s campus. This leveraging of resources allows ESL students access to career technical training.\nRSAEC’s vision for 2018-2019 is to continue the focus on offering more classes, increase contextualized learning opportunities, create new program and certificate options, and increase support services to adult learners within RSAEC to provide a smooth transition to college and career opportunities. To accomplish these goals, the consortium will explore new contextualized learning instructional strategies, which will lead to more opportunities for dual-enrollment. "
	},
	{
		"institution_id" : 384,
		"description" : "THIS IS A SUMMARY VERSION OF THE SAEC 2018.19 ANNUAL PLAN. THE FULL LENGTH VERSION CAN BE FOUND IN THE SUPPORTING DOCUMENTS SECTION, TITLED SAEC ANNUAL PLAN 2018.19 FULL VERSION\n\nDuring the 2014/15 planning phase, Sequoias Adult Education Consortium (SAEC) members and partners convened to write a comprehensive strategic plan. Members and partners analyzed the then current levels of adult education and compared them with regional needs. From that analysis, SAEC developed its Regional Comprehensive Plan. The plan articulates strategies to fill gaps, transition students, accelerate students through transitions, provides professional development to staff, and leverages regional resources. Funding was then distributed to members on a needs basis to implement strategies. The strategies identified in that plan remain relevant to the region today.\nMembers made significant progress towards implementing the strategies identified in the SAEC Regional Comprehensive Plan.  The current 2018/19 SAEC Annual Plan reflects the progress made to implement those strategies and the work that will be accomplished during 2018/19. The 2018/19 Program Year Plan describe few new strategies. The majority of any new work described is the continued refinement of existing strategies.   \nFurthermore, as noted in the SAEC Regional Comprehensive Plan, the AEBG to objectives  provide professional development and leverage regional resources are addressed in SAEC strategies focused on filling gaps, transitions, and acceleration. For example, to fill gaps SAEC planned, and implemented, a strategy to provide adult education courses.  The delivery of those courses by existing adult schools into communities that did not have adult education programs is built on members leveraging resources to host the classes at K-12 schools.  \nSAEC members have engaged many new strategies that address and support regional adult education needs, in many areas and in creative ways. These strategies successfully address all of the AEBG objectives. SAEC members will continue to refine strategy implementation and adhere to the three year timeline. The limiting factor moving forward for the region's efforts in adult education will be dedicated funding. It is  estimated that the adult education providers are meeting less than 10% of the regional adult education needs. "
	},
	{
		"institution_id" : 333,
		"description" : "Adult with Disabilities (AWD) Taskforce members toured programs to gather ideas to serve the population in our consortium. Information will be offered once the program has been revised at ABC and Norwalk-La Mirada Adult School (NLM). Cerritos College continues to outreach at member sites to assist with bridging students to the college’s academic and vocational programs. Tracking of students will be implemented in order to improve performance throughout the consortium. Increased course offerings in areas like ESL, VESL, Citizenship, Basic Skills, CTE Courses will be offered at sites to meet the demand and address identified gaps. Cosmetology at ABC Adult School and Automotive Service course and Energy Program at Cerritos College will be offered. ESL and GED classes in the Bellflower community will be offered. Cerritos College and NLM increased the number of class offerings to accommodate the demand of ESL and GED preparation in Spanish. ABC added Parent Leadership Academy workshops at off-sites with various hours to provide flexible schedules. Cerritos College is developing a new advanced manufacturing CTE Certificate. Discussions were held regarding the alignment of ESL courses throughout the consortium\nA pathways transition plan and courses are being developed at each member site. NLM and Cerritos College will provide transition support to students with the offering of 2-college credit Math classes at NLM. Downey Adult School (DAS) will be offering a Child Development course. Partnership meetings with SELACO WIB will occur to coordinate services with PAACE and SELACO-WIB/America’s Job Center. Ongoing webinars will be conducted to build awareness about each partners’ services. Will implement contract with web development and hosting contractor to manage the PAACE consortium website. Enhancement of information from members to the PAACE website was completed. Members ABC and NLM initiated and reinstated free child care programs to reduce the barrier of attending class. Upgrades in infrastructure have occurred at member districts such as remodeling classroom, testing centers, and repainting facilities. At ABC, a new dental hygienist laboratory is in progress, DAS and NLM are implementing dental hygienist program, and IT center, and media center. Expand Internship and childcare program at NLM. Identify strengths and weaknesses across the consortium based on the data gathered by BAYHA group. Analysis will be conducted and future decision making"
	},
	{
		"institution_id" : 382,
		"description" : "College of the Canyons (COC) and Golden Oak Adult School (GOAS) have partnered together to serve adult learners in the Santa Clarita Valley with a broad array of developmental and career education courses that expand access and opportunity for thousands of existing and potential students . The consortium’s vision, simply stated, is to provide a robust, comprehensive program supporting adult learners in the Santa Clarita Valley.  Our districts (the Santa Clarita Community College District and the William S. Hart Union High School District) have a long history of collaboration, and the AEBG consortium efforts have served to expand on the tradition of service to our community.\n\nIn the 2017-18 year, we successfully accomplished many of our goals either substantially or to completion.  We continued expansion of comprehensive orientation programs, identified transition courses, integrated career exploration components into GED preparation courses, implemented guidance and counseling services for students, pinpointed processes for ESL guidance and counseling, structured staffing roles based on student need as a consortium, and isolated avenues for braiding existing funding as well as explored sources of new funding. Additionally, we have identified accelerated instructional models in conjunction with dual enrollment to be implemented in Fall 2018.  We will continue with development of visual pathway maps for students and the community as well as joint outreach promoting adult education in the Santa Clarita Valley.  We will also continue our work with course alignment. \n\n"
	},
	{
		"institution_id" : 387,
		"description" : "The Solano Adult Education Consortium (SAEC) continues to meet the regional goals outlined in the three-year plan. Programs for ESL at all of our adult schools have increased enrollment and expanded access to other sites within Solano County. SAEC will more strategically focus on the following objectives:\n•\tDevelop consortium-wide career pathways programs\n•\tEstablish programs that provide support for adults with disabilities\n•\tDevelop seamless postsecondary transitions\n•\tProvide counseling and support services that enable students to stay focused on reaching career and academic goals\n•\tDevelop more programs that assist Solano community member to assist K-12 students to succeed academically and socially\n•\tExpand access to ESL and high school completion courses\n\nSAEC’s vision is to provide workforce and basic skills to students and job seekers through academic instruction, counseling and supportive services, and work-ready certificates to advance their career objectives and obtain sustainable wage employment.\n"
	},
	{
		"institution_id" : 353,
		"description" : "As the consortium moves into the final year of our submitted three year plan, we will continue to focus on providing services that allow for seamless transitions between the community partners and the educational institutions in programs such as the Adult Education Noncredit Summer Bridge as well as  focus on spending monies toward the implementation of new noncredit courses in CTE that will allow students to receive certificates and CDCP's upon completion.  In addition we continue to build our offering of ESL courses in the community by branching out to neighboring elementary schools, and CBO's as well as strengthen partnerships with our community partners that will allow us to offer basic skills courses, ESL and CTE opportunities to students who are considered nontraditional or disproportionately impacted.  This will also mean supporting faculty and aides who can assist in providing these services.  We will continue to support efforts on campus that are directed at meeting the seven program areas identified by AEBG. We will also in alignment to our submitted three year plan use funds to continue to provide professional development opportunities for faculty in meeting the needs of adult students as well as the Director of Adult Education.  There will be continued support to create marketing plans that will provide focus on the adult education program and courses.  Lastly, we will look at how we can begin to strengthen and create a comprehensive infrastructure that will support the colleges mission of a dedicated  noncredit adult education program in conjunction with the goals and objectives identified in our three  year plan.  LBCC adult education will continue to work with the Strong Workforce program to address high interest CTE programs for the community and students.  LBSA will provide a greater focus on creating course and programs aimed at meeting the lower literacy skills of potential students in the community.  They will also focus on keeping their CTE programs by creating short term, entry -level employment courses that also align to the college career pathways."
	},
	{
		"institution_id" : 344,
		"description" : "Over the past three years, the NSCCSTC made consistent progress in meeting the goals set forth in their three-year Adult Education Plan and, more importantly, in meeting the needs of the region’s current and potential adult learners. In 2017-18, the NSCCSTC continued to make progress in key areas that include: 1) increasing the scope of transition and support services, 2) accelerating student progress through more contextualized and enriched curricula, 3) developing data systems and processes to track student outcomes; 4) increasing collaboration across the adult schools and community colleges; and 5) establishing new partnerships with community-based organizations (CBO)s and community groups, including new partnerships with organizations focused on serving immigrant and undocumented populations.  \nFor the 2018-19 year, the NSCCSTC developed an annual plan that continues to align consortium efforts with priorities and strategies set forth in the three-year plan, but also allows for the flexibility and innovation to continue to meet the evolving needs of the region’s adult learners. Over the coming year, the NSCCSTC will continue to focus on developing and strengthening the regional adult education system through the following objectives: \n•\tExpand safety-net supports through new and current partnerships with local CBOs and community groups\n•\tStrengthen collaboration between adult school transition staff and their counterparts at community colleges\n•\tIncrease the number of aligned and, where possible, articulated curricula and CTE programs\n•\tIdentify opportunities to expand CTE programs to high-demand professions \n•\tCreate more work-based learning opportunities through new partnerships with local businesses \n•\tAlign ABE and ESL curricula to the evolving math and English placement standards\n•\tIncrease professional development opportunities for AEP faculty and staff \n•\tProvide more leadership and guidance for the NSCCSTC workgroups   \nWith the progress made over the past three years, the NSCCSTC continues to move forward with creating an accessible, coordinated, and comprehensive adult education system that works for all of the region’s adult learners. \n"
	},
	{
		"institution_id" : 371,
		"description" : "During FY 18/19, the North Coast Adult Education Consortium (Redwoods) will be actively pursuing achievement of the goals and strategies as listed in this plan. Specifically, efforts will be made to refresh relationships, and perhaps expand consortium members, to integrate our efforts with those of others in our communities. Initiatives with regard to local tribes and networking with the new operator of the America's Job Center (locally known as the Job Market) will occur. In addition, a re-energized outreach effort will be made to reach adult learners within region. Collaboration with the Workforce Development Board and the business community will also be used to develop strategies which on a contemporary basis will meet the needs of the target population. Our overall goal and mission is to support career and academic success by providing preparation and skills needed for employment, college readiness, and on-going education. \n\n\nSome accomplishments from FY 17/18 from College of the Redwoods, Adult Education included: \n--Successful completion of the 4021 Review \n--Stabilization of student enrollment \n--Oversaw exponential growth of the ESL cohort in Del Norte County\n--Reactivation of Adult Education ESL certificates\n--Implementation of the HiSET examination sites\n--Increased involvement and collaboration with local substance recovery programs for outreach purposes\n--Strengthened partnership with the Humboldt County Correctional Facility (HCCF)\n--Establishment of a faculty liaison\n--Conversion of the management office in Old Town Eureka to also provide direct service to students\n--Increased marketing \n--Obtaining robust CASAS data\n--Providing cross training to other CR departments to better manage registration and admission paperwork\n\nThe North Coast Adult Education Consortium (Redwoods) looks forward in FY 18/19 to its work on the behalf of current and future adult education students in our region. \n\n\n\n"
	},
	{
		"institution_id" : 328,
		"description" : "The AHC Consortium made considerable progress meeting the main goals of the 17/18 plan which had been initially identified in the AB86 3-yr plan. These are described as follows: (A) REGIONAL NEEDS: The consortium revised the work groups for ESL, vocational education, basic skills, High School diploma, and ESL Parent Academies to provide ongoing input on area needs. The HiSET testing was adopted and classes underwent revisions to include this new option. A part-time counselor for adults with disabilities is now in place assessing student needs and providing professional development workshops for instructors. Additionally, a CTE Advisory meeting will convene this fall to include input from area employers on gaps and regional needs connected to employability. (B) SEAMLESS TRANSITIONS – The consortium partners continued their work in developing articulation agreements and curriculum alignment in order to seamless transition students and incentivize acceleration of student progress. The consortium also continues developing CTE-related curriculum geared towards workforce preparation. The work groups have a foundational knowledge of best practices for instructional strategies, formative assessments, and expected outcomes. (C) DATA SHARING – With the adoption of CASAS to assess ESL students, the consortium has moved towards program alignment and seamless transitions. CASAS data discussion identifies gaps and patterns and develops effective practices for addressing these. The consortium addressed data collection and sharing, program alignment, seamless transition pathways, and maintaining the consortium’s mission. (D) PROFESSIONAL DEVELOPMENT – The consortium continues to provide professional development opportunities to instructors. During 17/18, the consortium convened a regional AEBG consortium forum to share best practices and approaches, and an iBest workshop. The consortium plans to continue these for 2018/2019. (E) LEVERAGING RESOURCES – The consortium was successful in leveraging resources from 3SP, BSI and Title V funding at the community college campus to provide student services and support professional development.\n\n"
	},
	{
		"institution_id" : 391,
		"description" : "The State Center Adult Education Consortium will continue to depend on concepts and principles set forth by our members to help guide the strengthening of adult education in our region. These principles form our vision of providing our adult learners with the skills needed for employment, continuing education, career advancement and personal growth. We will persist in enhancing adult education programs, expand course offerings, and nurture collaborative partnerships between educational institutions, workforce development organizations, employers, industry representatives, and community members, all while being focused on student success. \n\nThis year’s planned allocations are consistent with our three-year plan, as we continue to grow, and close gaps in service by implementing intervention strategies discovered from best practices gathered from our region, and throughout the state while consulting data from our Regional Fact Sheet. The 2017-2018 year has shown numerous success stories including increased CTE/ESL/HSD/HSE offerings, hiring additional instructional staff, increased transition services to all students/members, developed and implemented programs. We continued to bridge the gaps from adult school to community college, purchased and updated needed technology equipment, planned and began implementation of new adult school facilities for Selma, Sanger, Kings Canyon and Sierra. We improved collaboration with local Workforce Boards by working closely on the ELL Navigator Pilot.\n\nOur primary goals for this year will be to increase adult basic education availability, especially in rural areas, expand courses for immigrants, concentrating on ESL and Citizenship classes, improve adults with disabilities services, offer new, high demand, short-term CTE courses, as recommended by industry and current labor market information, and provide more resources for students to better understand career options, pathways, and opportunities. All members with the exception of the colleges will be using the ASAP Student Information System and AZTEC Software. All consortium members and workforce partners will utilize Community Pro Suites to highlight regional success.   \n\nIn conclusion, we are confident that through our strong leadership, our guiding vision, and our sharp focus on continually improving adult education and student success, State Center Adult Education Consortium will be able to meet and/or exceed all of our goals as set forth by our 2018-2019 Annual Plan.\n"
	},
	{
		"institution_id" : 380,
		"description" : "ACCEL’s planned allocations for the program year 2018-2019 are aligned with our three-year plan.  Building on the work in 2017-2018 of the four Collaborative Actions Teams (CATS), North County, Central County, South County, and Coast – ACCEL’s primary program goals for program year 2018-2019:\n1. Continued development by the CATS: the Collaborative Action Teams (CATS) in conjunction with local ACCEL staff will focus on continuing existing or planned programs such as the ESL Academic Bridge to Skyline, ECE Pathway, Career Exploration Courses and assessments, Certification programs including North Star Digital Literacy, Microsoft Office, Career Advancement Academies, assessment prep (ESL and GED), SMAS/CSM College Bridge, VESL programming on the Coast, and Entrepreneurship.\n2. Adult Pathway Bridge Development: an integrated Pathway Bridge model for adults with progressive levels of transition.  The overall bridge development is supported by the Implementation Design Team (IDT), a cross section of ACCEL Staff and instructional advisors.  Each team will be supported by targeted and ongoing professional development activities.\n3. Adult Education Needs:  ACCEL will continue to sustain, development and implement promising practice instructional and student services to meet unmet needs.  ACCEL will also continue to support the ongoing development of LaCosta, the recently restored adult school on the coast.\n4. Collaborative infrastructure: ACCEL ‘s continuing ongoing coordination and facilitation, data and fiscal management, leveraged purchases, and regional strategic partnerships.\n\nAccomplishments:\nNorth CAT (Collaborative Action Team): ESL Math Class, College Readiness Workshop Series, Immigration Workshop; financial literacy workshop (with Skyline College SparkPoint); job fairs.\nSouth CAT: 130 Sequoia Adult students transitioned to college; accelerated medical assisting courses (with JobTrain), and incorporated technology into ESL classes piloting Burlington English.\nCoast CAT: La Costa implemented a new 4th level of ESL; Spanish language classes (4 locations); integrated Workforce ESL, and Early Childhood Education Program with Canada College.\nCentral CAT: Pathway created – matriculation and skip placement; pre-advising at San Mateo Adult School for College of San Mateo; San Mateo ACES cohort priority registration, and College Readiness Series.  ESL City Academy, a partnership with the City of San Mateo."
	},
	{
		"institution_id" : 339,
		"description" : "Over the past year, the Contra Costa County Adult Education Consortium (CCCAEC) made progress across most strategies from the CCCAEC Three-year Adult Education Plan. In particular, the CCCAEC workgroups developed and implemented shared processes, standards, and tools to articulate curricula, establish formal pathways, and align career and academic standards. The CCCAEC expanded the level of resources and supports for adult learners by purchasing various classroom resources and tool kits, expanding bridge programs, and refining the roles and responsibilities of transition specialists. Lastly, the CCCAEC decided to expand data capacity through investment in several data systems, including Community Pro and EMSI. The progress made by the CCCAEC in the 2017-18 fiscal year continues to move adult education in the region towards a seamless continuum of educational services and supports. \nBuilding on this progress, the CCCAEC will use Adult Education Program (AEP) funds in 2018-19 to continue efforts to align and redesign the existing adult education system to expand adult education programs and services, strengthen partnerships, and, most importantly, support and bolster the academic and career success of adult learners. Over the next year, the CCCAEC will focus on the following goals:\n●\tAlign adult education math and English competencies with community college requirements and standards \n●\tExpand bridge course offerings across all adult education locations\n●\tExpand the levels and types of services available for adults with disabilities\n●\tAlign curriculum, student services, and transition activities to promote bi-directional student access \n●\tStrengthen partnerships with community-based organizations and workforce development agencies \n●\tRefine the CCCAEC infrastructure, including fiscal, voting, and management processes\n●\tImprove data integrity and develop more effective decision-making through the use of student, labor market, and fiscal data \n●\tDevelop a three-year strategic plan that is informed by data and responsive to the needs of adult learners throughout the region."
	},
	{
		"institution_id" : 356,
		"description" : "Executive Summary:\nThe Marin Consortium will build on the progress made in 2017 – 18 by evaluation of current programming and making decisions on programs offered in specific locations within the county, additional student support services, and growing CTE offerings for adults. Continued, additional focus will include active transitioning activities and programs for adult newcomer students who desire to finish a high school equivalency program then transition to college while employed. In alignment with the consortium’s 3-year plan, additional classes in ESL and HSE will continue, as well as expanded Pearson Vue testing hours and locations. The Marin consortium continues to work effectively with CBO’s in providing services for other AEP adults.\nRegional Planning Overview:\nProgramming for the current year includes:\n•\tLaunching of e2c (Education 2 Careers) Program through the partnership of COM and Canal Alliance. This program, which will be piloted in Fall 2018, will provide wrap-around services to Marin’s highest needs residents in the Canal. 20 students will be selected by Canal Alliance partners to participate in this 7-week program that will result in a for-credit Construction skills certificate and a hiring fair through Marin Builders Exchange. Wrap around services include lunch/dinner (depending on time of class), financial planning, skills portfolio training and career readiness sessions. Courses are held 2 times per week – once a week in a space at Canal Alliance (in the Canal) and once a week on the Kentfield campus at College of Marin.\n•\tA part-time adult education counselor to meet with students throughout the Adult Education service area in Marin to develop educational and career plans.\n•\tA Case Manager to guide aging out newcomer students into continued ESL and GED Prep classes in Spanish. The Case Manager will refer students to CBO’s for additional non-academic support and services.\n•\tGED preparation courses taught in Spanish in San Rafael and Novato\n•\tDevelopment of new noncredit hospitality, construction, business and landscaping non-credit CTE programs through College of Marin, campus supervisor training in Larkspur, instructional aid training in San Rafael, and continuing the introduction to in home care course in Larkspur.\n•\tExpanded Pearson Vue testing hours and locations\n•\tContinue partnership with the Marin Building Trades Council in offering pre-apprenticeship course in Marin\n•\tContinue parent education programs "
	},
	{
		"institution_id" : 369,
		"description" : "In 2018-19 NAC's allocation will be consistent with the three-year adult education plan by continuing to serve the community through increased offerings of basic education, ESL, and career pathways.  Members are actively participating in all consortia activities, cultivating relationships across sectors, and collaborating with fellow member and partners to fulfill the mission of AEBG.  The leadership of the adult schools and colleges are dedicating resources to the development and expansion of curriculum and services to support our region's adult population.  Alignment of non-credit ESL, CTE/iBest pathways, transitions support, and co-location of courses are areas in which NAC members continue to focus.\n\nNAC’s vision is to implement a co-op of shared resources, cultivate standards and develop an improved market that is committed to serving the adult learner population through successful development and delivery of programs, processes, and a system that transitions the learner from one entity to another without disruption to service. \n\nNAC accomplishments from 2017-2018 program year include the following:\n•\tProgramming to address the needs in ESL levels. We saw increased enrollment, as well as improved completion based on CASAS data.\n•\tOffered more classes (not to the level before funding cuts, but increasing annually).\n•\tHosted pathway event to focus on healthcare sector in the region. \n•\tPartnered with Strong Workforce Program Director to align initiatives.\n•\tDeveloped partnership with Alameda County Parole to increase the visibility to re-entry population and provide wrap around support.\n•\tHosted transition services at member sites .\n•\tBridge course offerings increased.\n•\tDeveloped noncredit courses to increase ESL offerings.\n•\tBay Area Alignment  partnership to integrate other programs serving young adults.\n•\tCompleted phase 1 of our marketing campaign which was new website development.\n\nIn 18-19 our primary goals are to understand the needs of the adults in our region and develop programming that meets the needs based on a current needs assessment. We aim to ensure programming is offered for adults to obtain livable wage jobs, to address the ESL population needs, to increase the success of acclimation to society for the reentry population, and for the acceleration of diploma and degree attainment to the adults in need."
	},
	{
		"institution_id" : 336,
		"description" : "The Citrus College Adult Education Consortium has a vision that all students achieve their career and educational goals. The CCAEC values efficiency, transparency, accountability, and institutional autonomy while member institutions provide quality programs for its adult students. CCAEC members help our region by offering a variety of vocational, career development, high school diploma and equivalency, basic academic skills, parent success, and English learner programs open to all adult students without discrimination. We provide our adults educational pathways into the workforce and/or higher education and all CCAEC courses facilitate our students’ incremental growth to pursue those pathways.\n\nAs the CCAEC moves into the fourth year of AEBG funding, the consortium believes it has made significant progress on addressing AEBG programs and objectives and it is poised to create a purposeful, effective 3-year plan.\n\nBy the end of 2017-18, CCAEC had maintained the levels and types of programs across the region that had been expanded in 2015-16 through regional collaboration and resource planning. These consortium maintained new offerings and programs in the face of higher costs from increases in salaries and contributions to retirement benefits.\n\nAligned learning objectives in CCAEC ESL, ASE, and ABE courses allowed for seamless transitions, and, critically, accelerated student outcomes. Language Proficiency Objectives for CCAEC ESL course descriptions were instrumental in creating a culture of progress and acceleration in all member ESL programs. Counseling efforts established pathway documents for CCAEC students so that they clearly understand how to achieve postsecondary and employment options. \n\nCCAEC members also leveraged the resources of a large number of partners to improve services for our students. Most notably, Monrovia USD utilized partnerships with WDBs to dramatically increase Title II funds to provide more CTE opportunities at no cost to CCAEC participants.\n\nIncreased WIOA funds allowed Claremont to better address HSD, ESL and ABE programs and better meet the  objectives of professional development and seamless transitions.\n\nThis 2018-19 Annual Plan demonstrates how CCAEC members plan to build upon the successes of the first three years of the program. The primary consortium goal for 2018-19 will focus on leveraging WDB funds to improve CTE programs for employers and potential employees."
	},
	{
		"institution_id" : 363,
		"description" : "The consortium’s vision is to provide a continuum of adult programming in Napa Valley to help adult learners reach academic and career goals. This includes:\n- Understanding the demographics and needs of the regional population to prioritize education and support systems\n- Emphasizing regional career opportunities, especially living wage opportunities\n- Providing transitions for a full continuum of education through to college\n- Partnering with regional organizations to leverage resources and better capture students\n\nKey accomplishments in 2017-18 include:\n- Created a common referral process to refer students to NVAE from NVC and to NVC from NVAE; established criteria, contact information and documents/assessment information to be shared between NVC and NVAE \n- Developed and piloted the hospitality program to expand CTE \n- Offered multi-level, and intermediate level ESL up-valley (Calistoga and St. Helena) (NVC)\n- Offered ESL College Prep course at NVC \n- Created and posted online \"Infographs\" to support Pathways and touchpoints (NVC/NVAE) for counselor to share with students\n- Improved use of student information to provide better services; piloted a Student Education Plan (SEP) (NVAE) \n- Added orientation to all CTE classes (NVAE)\n\nOur priorities for 2018-19 are:\n- Identify and implement agreed upon pathway and skill levels for service of ESL students at NVC/NVAE\n- Implement common referral protocol for students to NVAE from NVC and to NVC from NVAE\n- Provide AE courses and supports in for north county (\"up-valley\") for Calistoga/St. Helena including ESL and ABE/HS completion/HSE\n- Provide classes and supports to meet basic AE needs for south county (i.e., American Canyon) in ESL and ABE/HS completion/HSE\n- Improve services and supports to students with disabilities (e.g., counseling, tutoring and writing support class @ NVC)\n- Offer expanded workshops for parents to help K-12 students succeed in school\n- Explore and, if possible, implement Pearson Vue or similar testing resource\n- Expand CTE targeted at helping adults prepare for regional high-demand careers and/or improve current careers, both expanding current programs and adding new courses\n\nThese goals are consistent with the vision created in our three-year adult education plan for the region."
	},
	{
		"institution_id" : 366,
		"description" : "Palo Verde River Consortium’s vision is to serve the workforce training needs of adult learners residing within the Palo Verde College District service area. The mission is to provide adult education opportunities responsive to the employment needs of the communities of Blythe and Needles and the 100-mile remote area existing between the two cities, which includes two unified school districts, tribal entities, and several state prisons.\nFor 2018-19, members of the Consortium will continue to fulfill their mission to improve adult education opportunities for the communities of Blythe and Needles, California according to the 3-year plan. Consortium resources continue to be leveraged to improve and expand education and workforce training opportunities for adults in these communities, as outlined in our 2015-2018 three-year plan.\n2017-18 accomplishments and 2018-19 goals include the following:\n-Career planning: Implemented the Career Cruising on-line service that allows all students to identify and choose career pathways in both English and Spanish.\n-Bilingual GED preparation and testing: The dedicated effort resulted in a June 2017 celebration recognizing the successful passage of the GED by 22 students.\n-Career pathways: Continue to develop and pilot programs in agriculture, health, culinary arts, automotive and welding trades, and a parent education program to help parents improve student outcomes. Programs begin in Palo Verde Unified and  Needles Unified school districts and transition to Palo Verde College.\n-Marketing and communication: Developed and implemented a consortium website, along with marketing outreach materials for education and job training programs.\n-Dashboard Accountability and Reporting: The SchoolGauge data system is being installed for the consortium and the college to provide real-time student progress and effectiveness of use of resources, as well as meeting the data reporting requirements of the AEBG and WIOA Title II.\n-Culinary Arts Program at the AVI Resort: Working with the Fort Mohave Indian Tribe (FMIT) and Palo Verde College, the consortium has forged a special partnership leading to joint planning activities for a culinary arts program for adults residing within the consortium.\n-WIOA Title II: The Consortium recently became a participant in the federal Workforce Innovations and Opportunity Act (WIOA) Title II program. This achievement provides funds for improving literacy and workforce skills while tracking student outcomes."
	},
	{
		"institution_id" : 375,
		"description" : "Focus on increasing functional governance structures, effectiveness, and alignment of strategies as supported by budget and data. The SDAERC membership has changed significantly with new administrator level and additional representatives. Collaborative implementation of objectives will be critical especially those related to guided pathways supporting student learning and transitions. Concentration on the purposeful analysis of member and consortium level efforts and data. Increased communication efforts and systems to define and implement tactical strategies for improved outcomes and increased collaboration. \nPY 17/18 Accomplishments: 1)Expanded representation on the SDAERC, 2) Revised governance charter and corrections to the allocations to align with original intent of funding split, 3) Enhanced of integrated planning (SDCE), joint-member planning and starting to use online software to track objectives and aligning categorical funding streams (SDCE), 4) Staffing to manage and plan institutional research activities for data backed decision making, 5) Increased joint-member planning, 6) Noncredit report and subsequent recommendations recognized as a best practice, 7) Noncredit program marketing and messaging, including the use of student centered stories, 8) Advances in the institutionalization and establishment of the Academy for College Excellence (ACE) model, 9) Course creation, revisions, and enhanced instructional materials to better reflect credit standards, and/or to meet the demands of industry and/or to meet the needs of students, 10) Initiated planning and implementation for industry sector focused and pathways integrated with ABE and ESL e.g. Integrated Education and Training (IET) models, 11)Increased capacity related to AEBG through increased clerical/office staff to support communication, program level marketing, coordination of department level planning and training, collection and tracking of program level statistical data, coordination of community outreach, and to support community partnerships, and 12) Increased capacity for instructional program delivery by hiring instructional assistants in key programs, 13) Increased capacity for instructional programs, including online and hybrid courses, and supports for classroom technology, 14) Increased community and student outreach by creating outreach ambassador positions, and 15) PD Academy and mentorship model for new faculty and classified staff. "
	},
	{
		"institution_id" : 376,
		"description" : "Our vision for adult education in San Francisco: The Consortium prioritizes strategies to improve access to and success in high-quality instruction and support services for adult education students; foster seamless student transitions between SFUSD and CCSF and between school and work; and build adult education provider capacity through professional development. These goals were originally identified in our original three-year plan, and have been continually reaffirmed by our members and stakeholders in following years. \nKey accomplishments in 2017-18: \n1.\tProvided SFUSD students ages 18+ with expanded college transition counseling, “on-ramp” college and career readiness courses, and access to CCSF through dual enrollment courses at the college and credit recovery classes \n2.\tIn collaboration with CBO partners, expanded community outreach for noncredit classes and programs to build enrollments and provide enhanced services for vulnerable populations\n3.\tIncreased the offerings of contextualized basic skills instruction through the expansion of the Supported Instruction co-teaching model\n4.\tDeveloped and implemented a digital and print marketing campaign for CCSF’s adult education programs \n5.\tPresented at four state-wide conferences about AEBG-funded projects\n6.\tCompleted curriculum development for new DSPS classes & workshops on Career Exploration, Financial Literacy, and Computer Literacy\nGoals for upcoming year:\n1.\tDevelop and implement Phase 2 of adult education marketing and outreach plan\n2.\tImprove alignment with community partners to strengthen referral networks and leverage existing support services\n3.\tStreamline matriculation processes for noncredit students\n4.\tExpand collaboration with Student Development and Counseling to increase career and education planning services and promote improved job placement, wages, and self-sufficiency of adult education students\n5.\tWork with CCSF’s new Office of High School Programs to deepen partnership programs and smooth transitions for English language learners, students with disabilities, and those with low basic skills\n6.\tExplore provision of childcare & transportation assistance for noncredit students\n7.\tContinue to evaluate Supported Instruction initiative; use data to inform further refinement and expansion of the program\n8.\tSupport technology upgrades for adult education facilities and classrooms"
	},
	{
		"institution_id" : 381,
		"description" : "Vision: To advance and design new programs tailored for adults in our region using data-driven decision-making, and an inclusive, collaborative and coordinated approach with stakeholders, program leaders, and public feedback. Goals include increasing the development of more bridges from noncredit to credit programs, diversifying educational programming which address current gaps and needs, and working in tandem with WIOA and Strong Workforce objectives.  \n\nIn addition to our ten existing  AEBG Programs, the Consortium recently increased its programming in its third-year cycle with the following:\n1) Santa Barbara Library: Community Bridges Program. This program is designed to integrate all AEBG partners to effectively cross-refer clients; develop community resource awareness for adult learners; collate best practices that lead students to career pathways; offer workshops showcasing AEBG programs\n2) The expansion of the Noncredit Student Support Services (SSS) Program to provide advising, career and academic counseling, improved orientation to noncredit programs and transitional support to jobs/careers or credit opportunities. \n\nPrimary Goals for Upcoming 2018-2019 Year \n1)Continue to support our noncredit faculty in building bridges to credit for existing and new AEBG programs. \n2)Continue to fill gaps in Career Education in Industrial Technologies (or other areas supported by the study currently underway to be completed by 2018). \n3)Support new activity resulting from AB705 implementation (focused on mathematics, English, and ESL). \n4)Implement the Adults with Disability Career Planning and Training Program serving as preparation for further career technical and/or job placement assistance. \n5) Continue to partner with local Santa Barbara One-Stop operator and other agencies for career training initiatives.\n6) Continue to cross-pollinate AEBG initiatives with WIOA and Strong Workforce initiatives. \n7) A commitment to the collection of accurate data and analytics for all AEBG programs and services\n8) Continue to support our Student Support Services to help transition students from noncredit to credit or jobs/careers.\n9) Continue to support our existing SBCC programs that are aligned with the AEBG initiatives.\n10) Support job placement assistance efforts where feasible and allowable."
	},
	{
		"institution_id" : 332,
		"description" : "Our 18.19 Annual Plan is consistent and aligned with GOAL’s 3-Year Plan. The focus for our Consortium is on supporting adult education students to advance to employment and/or continued education, on increasing technology as appropriate to student needs and on the development of a bridge for transitioning students between the adult education system college and/or workforce. The alignment and integration of services that we seek is best achieved by focusing on pathways that serve the primary objectives of adult school students: Basic Skills, GED, ESL, CTE in serving students who wish to enter a career, advance in their career, or prepare for higher education within a CTE pathway. We will continue to strengthen the collaboration and partnership among Consortia members to one that is cohesive, collaborative, and cooperative and with a focus on student success. Support the on-boarding of our new funded partner Santa Cruz County Office of Ed; expand community awareness of adult education system opportunities for academic and career advancement through intensive and targeted marketing and outreach. Training and supporting new Transition Specialists and adult school and community college as well as expanded counseling services at the adult school to addressed increased need of counseling services for basic skills students transitioning to postsecondary. Develop a plan to expand adult education services in underserved areas of the Santa Cruz area such as San Lorenzo Valley in North County and Beach Flats; strengthen partnerships with CBOs and explore unique/new access points in existing service areas. We will align CTE, basic skills, and ESL pathways across our member institutions and expand ESL course offerings, including bridge classes, to meet community needs and help students transition to the postsecondary institution or workplace. Implement professional development activities centered on adult learning theory, CASAS assessment, technology application, and other best practices in adult learning. We will continue to articulate pathways in ESL, Basic Skills and CTE and facilitate improved communication & coordination among transition specialists/counselors/advisors of different consortium members.  Development of a comprehensive outreach & counseling plan for adult learners for transitional pathways to post-secondary institution/gainful employment. Explore the Immigrant Integration Framework and focus on populations with barriers to economic success. "
	},
	{
		"institution_id" : 373,
		"description" : "The ABOUT STUDENTS Consortium for Adult Education will continue to devote its efforts and resources to the expansion of the key program areas, including basic and secondary skills, English as a Second Language and immigrant services, and short-term Career Technical Education.  The consortium will continue to explore and provide additional opportunities to serve students needing workforce preparation, support for k-12 success, and adults with disabilities.  In alignment with the Three-year Plan, the local regional data demonstrates the need for additional services in areas lacking adult education services.  Members plan to increase course offerings in ABE and ASE academic classes, ESL, and short-term CTE to better serve the region and increase enrollment.  Additionally, members will focus on expanding our current processes for transitioning students to postsecondary education through educational advisors, campus tours and informational workshops.  The ABOUT Students Consortium will strategically expand its outreach connecting students to programs needed in the community.  Our goals includes increasing enrollment, expanding career pathways, increasing transition services to postsecondary education, and increasing effective outreach in our communities.  The ABOUT STUDENTS will emphasize its work to increase student completions and transitions to improve higher education opportunities, workforce attainment and reduce recidivism for incarcerated adults.  During the 2017/18 school year, the ABOUT STUDENTS Consortium has improved outcome data, provided regional professional development, and built support with community and educational partners, which has resulted in better service to students in our community.  Members are committed to share, continue, and expand successful practices that will strengthen our regional adult education programs."
	},
	{
		"institution_id" : 398,
		"description" : "Siskiyou County's vision for AEBG funding is to revitalize adult education in all areas of Siskiyou county and in\nTulelake. Consortia members have been developing and growing programs for adult learner success. The county is vast and\nvery rural, so it is important to design innovative solutions to services that serve our adult learners and overcome\ntheir geographic and access challenges. The consortia's vision includes streamlining services while offering common\ncurriculum and diploma completion. This has been a consistent thread within our three-year and annual plans and continues\ninto the third year of funding with articulation between adult school programming and community college non-credit\ndevelopment.\nActive communication with all stakeholders and community partners is of utmost importance to our student base as we roll\nout adult education programs throughout the county. Adult Education Pathways and its partners will need to provide ample\nopportunity for learning, skill development, and overall collaborative efforts within local communities and county wide.\nWe plan to leverage our resources across the Siskiyou Community College districts in aligning curriculum and transition\nadults into career and/or post secondary education.\nThe consortium believes that initial and ongoing development of its strategies and its staff is critically important to\nthe success of the new Adult Education model. All consortium partners, business community and county wide employer bases\nwill be encouraged to pursue more learners. This will allow for planning that ensures effective programs as needs change,\nproviding a wide range of opportunities for all adults. Adult Learners can be expected to obtain necessary skills\ninvolved with employment and educational satisfaction. Allowing students to utilize the educational facilities county\nwide and its flexible scheduling, taking into consideration personal capacity and learning modalities. The use of a\ncommon diploma in conjunction with computer-based software that is aligned with that diploma, will help students complete\nwork at their own pace."
	},
	{
		"institution_id" : 350,
		"description" : "Tehachapi USD will continue to expand the programs that have been successfully established during the last couple of years. The waiting list for the Adult Education high school diploma track has been significantly reduced. TAS was able to put in place the GED preparation classes as well as becoming a GED authorized testing site.Along the process our services expanded to CTE courses through our new welding program and work with CC to offer services to ss needing remedial. This year MONO will utilize County LIbrary satellites sites to provide diploma track, ABE, and other programs as needed.  Mojave AE continues to offer CTE and ABE courses while looking to expand.  SSUSD will continue to serve ESL students with ESL courses and ASE students through the HS diploma program.  Muroc Adult is building its ABE program with a dedicated instructor and administrator.\n\n\nBakersfield Sub-Region has accomplished expanding their service area together with the opening of the Job Spot, a joint effort with Bakersfield Adult and Bakersfield College.  As students complete their HSD or GED, they seamlessly transition to Bakersfield College without leaving the building. Resources include ACCU-placer, BC writing specialist and enrollment counselor and American Jobs Center personnel onsite two days per-week.  BAS has partnered with KCCD and non-profit, Catholic Charities to provide a Bilingual GED to homeless population who frequent the food pantry at Catholic Charities.\n\nNorth Kern Sub-Region will continue to collaborate on implementation of short term job training courses and provide support services to students as a way of increasing student matriculation. Delano AS will expand the welding pathway and begin to develop an automotive pathway in collaboration with BC. Wasco AS and McFarland AS will expand ABE and increase enrollment in the HS diploma programs. BC will continue to offer academic matriculation and counseling services to adult school students to improve seamless transitions.\n\nPorterville Sub-Region continues to serve ASE, ABE, HiSet Prep, ESL, and CTE programs while strengthening the transition from Adult School to Porterville College.  PC will continue to collaborate with Porterville Adult School to co-locate one stop shop services including academic counseling, educational advising, and support wrap-around services.  Partners in the sub region will continue to expand and align support services to students as a way of increasing students success and matriculation.  "
	},
	{
		"institution_id" : 362,
		"description" : "Southwest Riverside County Adult Education Regional Consortium has just completed a strong year of growth and progress.  As a unit, we were able to realize many of our original three year outcomes and implement some long range goals that were a focus for our team.\n\nOur allocation for the upcoming year will allow us to continue to move forward with our 2018-2019 plan and put in places some of the beginning steps needed for our next three year plan.   2018-2019 was not just an update for 2017-2018, but instead a whole new focus to continue with the progress we had made from our first three year plan.  We will be building on prior year growth for the 2018-2019 academic year, and looking at using our allocations once again as carefully as possible as we continue to make progress and increase students served and outcomes accomplished.  We also are putting an intense focus on the collection and achievement of data and student outcomes.  Staff development, training and data review will be at the center of our plan for this transition year.\n\nOur goal as a consortium is to build on what we have built so far to increase outcomes and look at common practices for all students. This will allow us to meet student needs while increasing outcomes across the region.  We will continue to offer region wide educational counseling services, additional career education classes and a greater number of more aligned classes to bridge our students into post-secondary.  This will be accomplished with more support from our partners and an intensified focus on using our partners to continue to serve our students concurrently.\n\nOver the past year we increased our career education courses, including Automotive, CNA, HVAC Medical Assistant, Medical Back Office, and soft skill workshops based on the Regional Workforce report for Riverside County with areas of need.  This was an increase over the prior year with much more focus and concentration on building Career Education services region wide. We also doubled the number of opportunities offered for staff development with regional workshops, trainings and opportunities to attend conferences.  Lastly, we increased the number of students supported throughout our region and the number of completers and students transitioning from our program with outcomes accomplished.  We are looking to continue with this progress over the next school year. "
	},
	{
		"institution_id" : 377,
		"description" : "In the 2015 Regional Plan we described our mission to promote the educational and economic advancement of adult learners through the coordination and alignment of educational and supportive programs and services. \n\nThe 2017-18 DSAEA accomplishments fulfill this vision through the following initiatives: \n\nMeeting the Adult Ed Needs of the Region  \n•\tExpanded ESL, ABE and ASE offerings\n•\tOffered courses at community locations \n•\tFurther developed the DSAEA consortium infrastructure through staff and professional development. \n•\tDeveloped the Allied Health pathway program in consultation with area employers as part of the Health Sector Partnership. Programs under development include a Registered Nursing Pathway and Medical Assisting Pathway \n•\tLodi Adult School collaboration with the Community Medical Centers for Medical Assisting externships\n•\tEngaged School District leadership at strategic points throughout the year to raise the profile of Adult Education programming. \nAcceleration\n•\tRegular consideration and discussion of the potential impacts of AB 705\n•\tOrganizing a dedicated Acceleration and Alignment group to address these topics \nTransition\nThe work of the Regional Transition Manager (RTM) to support students and further development of related transition services. The RTM provided transition services to over 1,000 students. Professional Development \t\nThe following teams and professional development events showcase the DSAEA’s ongoing commitment to Professional Development. \n•\tData and Accountability Team \n•\tAdult Education Leadership Network (AELN) \n•\tAgency-level strategic planning \n•\tLearning Innovations Team (LIT) \n•\tConferences attendance \n\nLeveraging Resources\n•\tSecured employer and stong Workforce program funding for the Health Sector Partnership with strong industry leadership. This collaborative model will inform future pathway development projects. \n•\tStockton School for Adults coordinated the offering of an onsite GED program at Conway Homes/Sierra Vista in collaboration with the Housing Authority of San Joaquin County \n•\tEnhanced WIOA Title II collaboration with SJ County WorkNet \n\nPrimary Goals for 2018-19 relate to the enhancement and expansion of the following: \n•\tCore educational programs and work with special populations \t\n•\tConsortium program development \n•\tStaffing (Teachers/ Classified/Admin) \t\n•\tFacilities/Locations \t\n•\tMarketing and Outreach \n"
	},
	{
		"institution_id" : 396,
		"description" : "The AEP Stanislaus Mother Lode Regional Consortium’s vision is to work collaboratively throughout our service area to assure students have access to high quality academic and CTE programs that lead to employment or post-secondary education. \nIn the 2018-19 FY, the AEP Stanislaus Mother Lode Regional Consortium proposes continued improvements and integration of adult education services in Stanislaus, Calaveras, and Tuolumne Counties by focusing on the following three priorities:.\n• Expand programs currently in existence to include English as a Second Language, Career Technical Education, citizenship classes, Adult Secondary and Adult Basic Education.\n• Reduce barriers and increase access and success for adult students by providing child care, career and college coaches/counselors, and increasing program offerings to include both day and evening classes at additional locations throughout the three-county area. Additionally, we will increase technology and classified support to these programs in the form of updated software programs, distance-learning sites, and clerical and para-professional support.\n• Implement high wage/high demand courses and opportunities that will lead to specific industry certifications.\nDuring the 2018-19 FY, the Stanislaus Mother Lode Consortium members are focused on the implementation of a collective 12-month work plan that is aligned with the three-year education plan. These efforts support building efforts in adult education for our three-county region. The Consortium will schedule consistent meeting dates that support approved governance and operating procedures. It is anticipated that this work will assist in developing a clear picture of regional needs and resources.\nDuring the 2017-18 fiscal year consortium members collaborated and leveraged resources improving and/or enhancing services to adult education learners in the three-county region.\n• Supportive Services: Child care, Career and academic counseling, inter-agency referrals including to incarcerated adults.\n• Expansion of HSE, ABE, ASE, and ESL throughout the consortium region.\n• Expansion of CTE programs, pathways, and industry certifications throughout the region (i.e. truck driving, forklift, industrial maintenance, welding, construction, phlebotomy, pharmacy technician, medical assisting, etc.).\n• Expansion of Consortium public and private industry partnerships.\n• Rebuild infrastructure and updated technology to meet current standards"
	},
	{
		"institution_id" : 360,
		"description" : "MPAEC partners continue to work together to ensure that our planned allocations are consistent with our 3-year plan to create a thriving, expanded collaborative, adult education consortium for our region. Our 3-year plan identified priorities for our consortium to expand offerings in all program areas, improve transitions between schools, respond to the need to provide a variety of student support, provide quality instructional materials to help students succeed, and more information for students about course offerings, registration processes, child care, computer access, financial assistance, and other support available. \n\nMonterey Adult School (MAS) and Pacific Grove Adult Education (PGAE) funded ESL, HS Diploma/GED, and Adult with Disabilities programs. MAS, PGAE, and Carmel Adult School (CAS), continue to implement CTE programs to help students obtain new and stronger skills that translate to career opportunities in our region. Also working with local businesses providing ESL and skill development instruction to staff, PGAE continued partnerships with the Local Electrical Workers Union and the WIB providing on-site Apprenticeship Classes.\n\nMPAEC 2018-2019 plan will focus on the following priorities to continue progress toward goals outlined in our 3-year plan: \n\n- Increased enrollment in the Adult Education programs through marketing/advertising.\n- Supported opportunities for faculty and staff professional development at all sites. \n- PGAE will provide child care beginning next year, continue its Adults with Disabilities program providing classes to students with mild to severe disabilities. \n- CAS is building on ESL and HSD/GED 2018-2019- that provide integrated level ESL courses, which will increase enrollment (by approx. 100%) by working at 4 separate sites\n- MAS absorbed MPUSD’s Certified Nursing Assistant Program and continued operation of 2 satellite ESL programs. The move to a new expanded campus incurred new infrastructure costs. MAS expanded Parent Ed which served over 130 adults.  MAS increased payment points by 27 %.\n- MAS and MPC worked to develop pathways in HOSP and ECED. MAS has begun work on a new kitchen that will serve students in HOSP. \n- MPC is exploring  of  alignment of its ESL program with adult school partners and has established a pathways specialist position to facilitate this work. \n- MPC has begun to provide outreach and counseling services at specific adult school sites to assist students with education planning. \n"
	},
	{
		"institution_id" : 383,
		"description" : "The Santa Monica Regional Consortium for Adult Education (SMRC) will close identified gaps through its vision of becoming the regional hub for literacy, high school/high school equivalency completion, and noncredit career development and college preparation (CDCP) programs. The planned AEP allocation is consistent with the three-year plan as funds will be utilized to support curriculum/program development, digital literacy, technology, student services, marketing, instruction, professional development, and noncredit/adult ed staffing. SMRC's vision is supported by year 2017-18 accomplishments: Enhanced and aligned ESL and high school curriculum; Updated the SMRC student pathways counseling folder that includes CCCCO spring 2018 approved noncredit CDCP programs; Local approval of new noncredit CDCP programs: Elder Care, Transitioning to College and Career Readiness, and Sustainable Technologies; Completed training for the initial implementation of the CommunityPro data and accountability web-based application; Implemented technical plans to increase faculty and student digital literacy; Hosted the second annual Business and Community Partners’ Event; Hosted the first Career Resource Fair for noncredit/adult ed students; Distributed SMRC's first adult ed newspaper (inserted in the L.A. Times and in local newspapers); Participated in noncredit professional development events to increase knowledge of noncredit academic programs and student services; and, Participated in adult ed conferences and trainings. SMRC's primary goals for year 2018-19 include: (1) Full implementation of the CommunityPro web-based application in collaboration with community and industry partners; (2) Offer and assess the effectiveness of CCCCO approved noncredit CDCP programs: Bicycle Maintenance, Business Essentials Level 1, Customer Service, Introduction to Early Care and Education, and Rehabilitation Therapy Aide; (3) Explore the development of new noncredit CDCP programs; (4) Participate in professional development; (5) Identify and develop successful marketing strategies/technology to increase student awareness/completion and faculty, industry, and community engagement; (6) Participate in Chamber of Commerce and Cradle to Career meetings; (7) Connect with local employers and agencies to determine academic and employee training needs; and, (8) Recruit classified staff to better support noncredit/adult ed programs."
	},
	{
		"institution_id" : 367,
		"description" : "The Education to Career Network of North San Diego County (ETCN) was able to meet, and in most cases exceed, our goals set in all key program areas. Major accomplishments in 2017-2018 include:\nSymplicity- Student Career Services Manager: Rolled out an online program designed to assist students with career readiness, career exploration and job search. The Career Toolbox function provides students with online assistance developing resumes, cover letters and practicing interviewing techniques through online videos and specialized modules.  EMSI and ASAP – Initiating EMSI has informed our decision-making process as it relates to offering curriculum based on gaps and needs in the region. It is helping us identify growing industries and accomplished employers with whom we can partner. ASAP’s Service Hours module has helped counselors and advisors document and manage student appointments and caseloads more efficiently.  Legislative and Community Outreach Campaign: ETCN information packets were shared with local legislators leading up to visits during Legislator’s Day in Sacramento.  Established the first-ever county-wide “Adult Education Week” proclaimed by the San Diego County Board of Supervisors.  2nd Annual Path to Palomar Event: Based on the success of the first year’s event, Leadership members participated in the spring event designed to showcase Palomar College’s course offerings and introduce adult education students, many for the first time, to a college campus.  After the campus tours, students met with Palomar career counselors, transition coordinators and other support personnel. Digital Badging: Adopted the Riverside consortium’s badging program and ForAllSystems platform and began development of teacher training materials and roll-out program to students targeted to commence Fall 2018. Our 2018-19 plan goals include the following highlights: Host a Community Forum to inform and share achievements over the past 3 years and to gain input on ways to enhance student education/career success and determine industry workforce needs; Roll out of the digital badging program and development of 2nd phase for CTE courses and pathways; Continue alignment and integration of curriculum to accelerate student learning and meet regional workforce needs; Developing Adult Education Pre-Apprentice programs which either articulate to Palomar College or directly into a trade union program; ETCN’s motto “It’s Working” continues to ring true within the communities we serve."
	},
	{
		"institution_id" : 352,
		"description" : "“The Lassen-Modoc Adult Education Consortium (formerly Lassen County AB86 Consortium) is dedicated to meeting the needs of the community and local employers by providing adult education opportunities in Lassen and Modoc County.  Adult learners will complete high school diplomas or  equivalencies,  acquire and improve English Language development and literacy skills, and vocational skills with short-term CTE classes. By obtaining educational and employment skills this provides adult learners the opportunities to obtain meaningful employment and participate effectively as productive workers, family members, and citizens in the community.”\nThis was the Mission statement that the consortium adopted on May 16, 2014. \n\nThe mission statement, vision and the goals of the consortium have remained  consistent moving forward from AB86 planning to AEBG  implementation and now into California Adult Education. The consortium agrees annually upon these goals and their top priorities by  allocating funding to service  each of the eight communities in their service region with AEBG adult education programs.   \n\nThe vision of the Lassen County AB86 Consortium agreed upon in 2014:\n“Providing preparation and skills needed for employment, career advancement, continuing education, and personal growth for our local residents\". The vision aligns with the consortium goals  “To have a seamless way adults will complete their education and employment skills (diploma equivalency and vocational training) to enter the workforce.” \n\nServices for adult learners have been aligned between consortium member programs that include seven educational school districts, two county offices of education, the community college, one charter school, local agencies and workforce. Continuing with the 2017-18 year programs that offered literacy classes and workshops, ESL and citizenship classes,  high school diplomas or equivalency with GED or Hiset preparation and testing, and training instructional specialists/parents to assist school children; the consortium provides many educational opportunities for the adult learner.  The CTE offerings with employment skills include classes or workshops for computer applications and graphic arts, construction, welding,  automotive, and culinary/food service, CPR and basic firefighter safety, as requested by our regional employers.  \n\nIn May 2018 the consortium listened to twenty-five programs request funding for the  2018-19 school year. At the July 2018 consortium meeting the school district allocations were confirmed with agreement to fund eleven school sites with a variety of diploma equivalency programs, CTE short-term classes for basic employment skills, staff and parent training for student success, a Career Pathways program, a Parent University program, Jail Education programs in two counties, a Behavioral Health specialist and an AEBG Counselor.  \n\nNew goals for 2018-19 include:\n1.   To ease the transition process for the adult learner we will align all consortium programs with pathways and referrals to higher education or employment.\n\n2.  Utilize our student data collection to measure the student outcomes for the effectiveness of programs currently offered and design of future programs.\n\n3. Develop more engagement and stronger partnerships between education, local agencies and workforce in the communities to align programs and meet employer's needs.\n\n4. Create a marketing campaign for outreach to all rural communities in our service region to showcase programs currently offered.\n\n\n\n"
	},
	{
		"institution_id" : 365,
		"description" : "During 2018-2019, the Consortium plans to continue to build on the collaborations developed among the consortium members and partners as well as to maintain current levels of service to the adults in the Consortium area. The Consortium will continue to support the CTE pathways in Early Childhood Studies and Residential Care as well as explore the coordination of CTE at all schools.\n\nThe Consortium will continue its focus on marketing. In addition to the newspaper supplement that is in the process of being developed, the Consortium will redesign its website to provide a regional focus on programs offered by the Consortium members.\n\nNew programs and partnerships to be pursued include the exploration of development of a welding program with MVROP, an IT program with Ohlone College, a finance banking program with Jewish Vocational Services, and a hospitality program also with MVROP.\n\nFinally, in order to support distributed leadership for Consortium work among the four members, the Consortium plans professional development in the region for this purpose."
	},
	{
		"institution_id" : 394,
		"description" : "The West Hills Adult Education consortium (WHAEC) will continue to enhance educational programs and expand course offerings through its partnerships with educational institutions, workforce development organizations, employers and community members while focusing on student retention and success.  The 2017-2018 has demonstrated increased growth potential and expanded collaboration among board members, outside agencies, and the communities served.  This past year the consortium served 1,742 students, a significant increase from the previous year. Consortium member, Firebaugh Las Deltas Unified School District applied for and received ACS/WASC Accreditation, which will further enhance the post-secondary opportunities that come with an accredited program.  This has inspired another member, Reef Sunset Unified School District whom have already begun the process to become ACS/WASC accredited as well.  \n\nCurrently, six of our nine members offer diploma programs and one member offers High School Equivalency (HSE) preparation at four sites in the region. Additionally, four of our members provide ABE courses, which address the gap of high school attainment in this region.  All consortium members initiated CASAS pre and post-testing and will continue providing CASAS assessments for their ESL/ABE/ASE/HSE courses.  Additionally, all members will expand the tracking of their enrollments and enter student demographic information into the CASAS TOPSpro database as mandated by the State CAE office.  \n\nCitizenship courses continue to expand as the demand continues to grow.  The WHAEC expanded their CTE trainings which included forklift certifications, truck driving and residential electrical. Two-hundred and fifty-nine (259) completed skills trainings.  A primary goal for our college members this year is to implement an ESL Certificate of Achievement, which will provide a pathway into either advanced CTE and/or Academic degree programs.  These four level ESL classes will be offered as non-credit at both WHC-Coalinga and WHC-Lemoore. Additional goals include expanding courses for immigrants such as ESL, Citizenship, and Computer Technology; we will also expand ABE/ASE/HSE availability in the rural communities and expand offerings of high demand short-term CTE courses. \nThe consortium approved hiring a consortium level career pathways advisor. They will disseminate consortium, college, and partner agencies programs, career options, develop ed plans and set long-term goals ."
	},
	{
		"institution_id" : 395,
		"description" : "The vision of this Consortium is to provide adult education in western Kern County with a strong emphasis on education services relating to English as a second language, citizenship preparation, short-term career technical training, and basic skills needed for academic and career success.\nDuring the prior program year we met many of our program goals including:\nAligning regional academic and career pathways leading to employment and post-secondary education and/or the workforce.\nWKAEN has collaborated closely with industrial and educational partners to develop strategic pathways for our students.\nEvidence of this is reflected in new and innovative course development in Career Technical Education. Taft College, Taft Union High School and WKAEN collaborated together to develop and offer the following short-term CTE courses:\nPersonal Care Aide forty-hour course provides the graduates with the skills to obtain entry level employment in the home health care field. \nWelder’s Helper forty hours course provides an overview of the necessary safety, theory, and practical Lab experiences associated with local industry types of welding processes.  \nBasic computer forty-hour course provides basic computer training and the foundation for education, training students to be computer literate in the work field, and promote short- term and long–term computer skills.  \nSecurity Guard Card forty hour provides an opportunity for students to be trained and certified in the Guard card and Gun Safety / Self-Defense program with transitions into Taft College Criminal Justice program and the work field.  \nFork Lift Certification eight-hour course provides safety instructions specific to the field, to prepare students for the work field, and to certify students with the training and knowledge of Fork Lifting.\nDrivers Ed Preparation 64 hour course targets adults with disabilities and prepares them to pass the DMV written exam.\n\n\n\n\n\n-Community outreach development is key in our success. We plan to increase our efforts to attend local outreach events as well as enhanced visibility in local social media groups. We expect this to result in consistent growth in class size as well as increased traffic through our office by prospective students.\n-Development of relevant ESL course offerings will be a priority. We have developed a comprehensive ESL program which resulted in three levels of effective ESL offerings.  A priority of this year’s ESL program includes reaching new students."
	},
	{
		"institution_id" : 338,
		"description" : "The Tri City Adult Education Consortium continues to work toward creating seamless pathways that help learners secure heightened levels of language preparation and short-term career entry.  Since the 2015-2016 year, tremendous progress has been made in establishing the core criteria of our consortium through building a common mission and purpose.  Fast-forward to the 2017-2018 year and it is immediately apparent that progress has been made in the areas of creating seamless pathways, curriculum alignment in ESL, establishing a shared sense of professional development for faculty and the Board, as well as creating opportunities to accelerate students to the community college through our upcoming Cosmetology dual enrollment course offering at Paramount Adult School. The current planned allocations for the 2018-2019 program year are an outgrowth of our collective work stemming from the prior three-year adult education plan and we are committed to establishing converging programs of study that create increasing opportunities for development and advancement in the adult school population.  Tri City Consortium connects education and workforce training to create family sustaining careers.  With this mission in mind, we work collectively to carry out our core vision of being data driven, operating as a benefit to the entire consortium, ensuring that we leverage our resources, identify core gaps that need to be filled, a reliance on the plans approved by the Board, a commitment to work through activities toward outcomes, ensuring that opportunities can be taken to scale,  and finally, ensuring that our institutions are using resources to create supplemental opportunities  and not supplanting.  To this end, the 2017-2018 year included a number of firsts for our consortium, including hosting the CCCCO Sponsored Increasing Rigor Across Adult Education training at Compton College, offering our first Curriculum Alignment PD for ESL faculty that will result in articulation agreement development, continued focus on the medical pathway in phlebotomy and the senior care industry, a new focus on Cosmetology being offered at Paramount Adult School, computer technology courses that will blend into the college Business Information Worker pathway, and a new training area of focus in non-destructive testing, which leads to living wage employment.  A renewed focus will be placed on soft-skills through the New World of Work and outreach workshops will be offered at each site."
	},
	{
		"institution_id" : 329,
		"description" : "The overarching mission of the Antelope Valley Regional Adult Education Consortium (AVRAEC) is to strengthen all areas of adult education in the Antelope Valley.   \nAs we move into year three of the performance phase, the AVAERC remains committed to our collaboratively determined priorities of the consortium and community:  \n1. Maintaining current successful programs offered by members of the consortium is our number one priority.  While the consortium recognizes a need for growth in many areas, it also recognizes a need to maintain programs that are thriving and servicing adults of the region now.   \n2. The consortium feels that supporting growth in the following areas will give the region the greatest gains: \n-\tCareer Technical Education and Apprenticeships  \n-\tEnglish as a Second Language and workforce preparation\n-\tAdult Basic Education  \n-\tAdults with Disabilities  \n-\tWe have incorporate the two additional program areas for older adults into each of these areas   \n"
	},
	{
		"institution_id" : 348,
		"description" : "In program year 18-19, the SVAEC will continue the work it did in 17-18 to offer comprehensive adult education services throughout the region. In the new program year there will be even more emphasis on outreach and marketing; counseling and transition support; basic literacy and digital literacy instruction; and workforce development through job training & placement programs and stronger industry partnerships. \n\nGreat gains have been made and the SVAEC will continue to meet the objectives of AB104 by employing the strategies in our three-year plan. Gaps in service are being filled by increasing the amount of ESL, basic literacy, ABE/ASE, HSE, HSD, citizenship, and digital literacy instruction as well as the diversification of course levels, schedules, and locations. Programs are being aligned and student transitions facilitated by ongoing curriculum alignment; standardization of intake, assessment, and data collection/reporting practices; and improved support for adult learners transitioning to college or the workforce. Students are progressing faster due to blended learning strategies and the use of instructional technology; increased offerings of short-term CTE programs; and contextualized academic support for CTE students.\n\nSome accomplishments to highlight from this past year include increased services in the county jail by MCOE & Hartnell College, including more HiSET instruction & testing, new workforce readiness & pre-CTE instruction, new college classes, and new college & career pathways support for inmates before and after release; new Forklift Certification and Food Safety Certification classes at Gonzales Adult School; a new Registered Dental Assistant program and planning for a Community Health Worker program at Soledad Adult School; collaboration by Salinas Adult School with Project Search, an internship program for adults with disabilities; new noncredit ESL courses at Hartnell; increased Citizenship Prep courses throughout the region with great success – North Monterey County Adult School alone had 27 students pass the Citizenship Exam; new bilingual computer classes in King City provided collaboratively by South Monterey County Adult School & Hartnell; and new basic English & Spanish literacy courses started at North Monterey County, Salinas, and Gonzales Adult Schools. \n\nNow with a stronger foundation established, the SVAEC’s primary goal is to increase student enrollment, completion, and progression."
	},
	{
		"institution_id" : 378,
		"description" : "Development/implementation of the 18-19 plan is facilitated by the collaborative structures of SBCAE. The Steering Committee, with faculty representation from both systems, meets twice a month. These reps assure that allocations are made consistent with the regional and annual plans. Other SBCAE groups include: a Consultation Council, with faculty and classified reps from all members; a network of 15 Transition Specialists from all members; 4 faculty workgroups with reps from all members; and a data team from both systems.  These groups regularly evaluate the progress of the 9 project workplans and their coherence to the Regional Plan: SBCAE’s Vision of a “no wrong door” system of adult education with clear and easily navigable pathways for adults as they progress from basic skills into training and family-sustaining employment with courses that accelerate progress with systems of targeted supports. SBCAE is also committed to specific supports for immigrants to achieve greater integration into their communities, and for students with learning differences to receive appropriate instruction and support. A central guiding principle has always been to focus on the needs of students, not on institutions. Other accomplishments this year include: transition specialists working together to expand support services; an adults with disabilities specialist supporting all members; college classes co-located at adult schools;  web-based navigation resources for students; piloting supports/metrics for immigrant integration; CTE bridge classes; colleges joining 3 adult schools in a WIOA consortium; curriculum development and articulation in ESL and Basic Skills; community outreach; data and accountability, and professional development, including special focus on adults with disabilities and Human Centered Design.  Primary goals for 18-19 will build on these 9 project areas – some activities will be extended from last year, and some new activities emerged from what we learned. A new priority for 18-19 is to explore how other funds may be leveraged. Also, in 18-19 we will work to better define and measure what’s effective. These nine revised project workplans, distilled in the responses to Regional Needs and subsequent Strategies below, express the primary goals for the 18-19 annual plan.  Our mission is embodied in these projects and ongoing review affirms that current allocations are used by all members to carry out the activities listed in the project workplans."
	},
	{
		"institution_id" : 346,
		"description" : "The Glendale Community College District Regional Consortium was branded in Program Year (PY) 2016-2017, as Glendale Local Education and Resource Network Services (GlendaleLEARNS). GlendaleLEARNS entered PY 2017-2018 focused on expanding access to adult education and driving innovation throughout its programs and services. These efforts are in alignment with its vision of: All adult learners will have access to education through collaboration, shared resources, career pathways, seamless services and innovative programs, to meaningful employment or higher education. \n\nGlendaleLEARNS established goals for PY 2017-2018 to achieve its vision including: expand access to ESL courses throughout the community, expand programs available to adults with disabilities (AWD), continue co-enrollment with WIOA and other partners, implement job development for adult education students, and continue professional development to drive innovation in programs. The Consortium established five Committees to address established goals and strategies. The Committees developed Action Plans based on its Annual and Three-Year Plans and continue to revise and implement them throughout each PY.  \n\nThe Committees completed 86% of their Action Plans established for PY 2017-2018 Annual Plan. Actions completed included integrating partnerships to expand services to students with multiple barriers and offering a job development service for those students wanting to focus on employment. ESL courses were expanded and are now offered throughout the community in partnership with the Verdugo Workforce Development Board (VWDB), Verdugo Jobs Center (VJC), International Rescue Committee (IRC) and Glendale Library Arts and Culture (Library). One of the most notable accomplishments was the use of Human Centered Design to develop a co-enrollment process and implemented the process with a universal application that allows students to enroll with multiple partners and funding sources to meet their educational and employment needs.\n\nBased on successes achieved in PY 2017-2018 and identified needs in the region, GlendaleLEARNS is committed to continue expanding services to students with multiple barriers including: English Language Learner students, students needing Adult Basic Education (ABE) or Adult Secondary Education (ASE), and AWDs. GlendaleLEARNS will continue working with its partners to continue its innovative co-enrollment of students in WIOA and non-WIOA funding sources. \n"
	},
	{
		"institution_id" : 335,
		"description" : "The vision of the West End Corridor Consortium continues to be one of providing comprehensive, relevant, and high-quality education and training in serving the needs of adults in the region.  This is accomplished through the leveraging of resources focused on providing viable career pathways and seamless transitions to post-secondary and vocational programs, increased accessibility through a variety of schedules and modalities, and attention to the acceleration of student progress through program integration and co-location of classes.  The Consortium is committed to student-centered approaches to access and guidance, as measured through outcome data and student and staff surveys.  The Inland Empire is still one of the fastest growing regions in the state, with a constant need for qualified individuals to join the ever-expanding and changing workforce.  By keeping up-to-date with regional economic and workforce trends, providing in-demand programs, taking students’ barriers to success into account, and providing meaningful professional development, the West End Corridor is accomplishing the goals set forth in its Plan.\n\nFor the 2018-19 program year, the West End Corridor Consortium priorities and allocations remain consistent with the strategies that were identified in the initial Three-Year Plan.  These fall within the overarching concept of workforce preparation through the development of career pathways, improved outreach and accessibility, increased transition opportunities, a greater variety of short-term CTE offerings, strong foundational literacy and basic skills programs, the attainment of secondary credentials, and the integration of basic workforce and technology skills across programs.\n\nAccomplishments:  Program growth; increased technology and software; web-based CASAS testing; increased HSE and industry certification testing; career planning focus through software and career centers; orientation and transition counseling; increased collaboration among agencies; dual-enrollment opportunities & program integration; support for professional development; WEC Program Coordinator\n\nPrimary Goals:  Next 3-Year Plan; focused marketing plan and budget; increased offerings to address student demand and learning modalities; expansion of career education and services; increased focus on professional development and use of data to drive instruction & program design; increased collaboration with community college, including tracking student transitions\n\n"
	},
	{
		"institution_id" : 388,
		"description" : "In preparation for the new three year adult education plan, Sonoma County Adult Education Consortium (SCAEC) members participated in a strategic planning session and a Stakeholder’s Meeting in order to solicit information about how to best serve shared constituents.  This was necessary, as the firestorm that engulfed the community in October 2017 has changed priorities for many agencies.  Housing, food and job insecurity due to the loss of over 5,300 homes, 700 non-residential buildings and 600 businesses has stretched the resources of local agencies and has impacted student retention and completion.  The fires also impacted employment for construction and trades that must be addressed for the county to recover emotionally and economically.\nKeeping this in mind, the Oversight established some broad long-term (3-year) goals, as well as short-term goals for the current academic year. Our long-term goals include:\n1.\tExpand or deepen partnerships with Community Based Organizations, School Districts, and local governments to better serve students in closer proximity to home\n2.\tDevelop and implement non-credit and adult school online course offerings for high school diploma/equivalency, ESL, and Career Education\n3.\tFacilitate collaboration and articulation between SCOE and Petaluma Adult School with SRJC to increase matriculation to post-secondary education and non-credit certificate completion\n4.\tAlign sequencing of adult school computer instruction with SRJC to increase non-credit certificate completion\n5.\tExpand construction and trades related training options through the development, approval and implementation of new courses and certificate programs to meet Rebuild Sonoma County efforts\n6.\tIdentify and implement continuing professional development for faculty, staff and administrators of adult education and non-credit programs aligned with the seven program areas\n7.\tEstablish a deeper connection with north bay and bay area consortiums to increase awareness of opportunities for students throughout the region and provide a greater support network of resources to our consortium partners\n\nThe SCAEC is a direct-funded partnership.  Each agency has allocated funding based on the services their agency provides and in keeping with the overall Regional Plan for Adult Education. To this end, the Oversight Committee identified nine key areas of focus for the 2018/19 academic year:\n1.\tMaintain and support ESL, HSD/HSE, and family literacy programs\n2.\tExpand Workforce Preparation and Career Education industry area offerings to align with regional workforce need\n3.\tEstablish and utilize Community Pro software to connect agencies to provide wrap-around services\n4.\tRecruit and hire qualified testing technicians to assist with data collection through the CASAS pre and post testing process\n5.\tRegularly schedule Outreach Specialists at existing education/resource centers to assist students with work/school transitions\n6.\tDevelop a process to continue to collect data on gaps in service provision, and provide an updated needs assessment by June 2019\n7.\tProvide professional development, as well as resource information, to instructors on barriers to student engagement, retention and completion that include, but are not limited to the following topics: housing, food and transportation insecurity; child and elderly care; addiction and mental health issues; and domestic abuse\n8.\tEstablish a north county hub with space to possibly include a family resource center\nThe Oversight Committee also reflected upon the accomplishments of the SCAEC for the 2017/18 academic year:\n1.\tPetaluma Adult School expanded the HSD program into Sonoma Valley and Santa Rosa with over sixty high school graduates.\n2.\tSCOE implemented the Intro to Construction course in Santa Rosa and Sonoma to immediately address training needs for construction workers post-fires.  One hundred students have completed the fifty-hour course. \n3.\tStrengthened partnerships with La Luz and Job Link to provide wrap-around services to students in the Construction courses.\n4.\tEstablished a multi-media presence for SCAEC using several social media platforms, print materials and radio advertising.\n5.\tEstablished the SCAEC website in August 2017 (English/Spanish) to provide general information a\n"
	},
	{
		"institution_id" : 355,
		"description" : "Year 4 focus is to continue to enhance services and instruction. Preliminary student data report for the program year 2017-18 reveals that the unduplicated number of 15,030 adult learners in the region enrolled with CAERC member agencies and received services. The number of learners who demonstrated measurable skill gains is 8,309 and is included in 10,108 AEBG outcomes achieved. \nIn April 2017, the Sacramento Employment & Training Agency (SETA) – a CAERC partner – was awarded one of the California Workforce Development Board’s English Language Learner (ELL) Workforce Navigator grants. Four CAERC members partnered with SETA to support ELLs through this innovative joint education/workforce initiative.  As of August 2018, there are 146 enrolled in our ELL Workforce Navigator Pilot up through June 30.  104 are co-enrolled in WIOA Title II Adult Education programs, of which: 97 are enrolled in ESL or VESL (primarily ESL), 8 are enrolled in Adult Basic Education (ABE) and 6 are enrolled in high school completion/equivalency. 44 have entered employment with a $12.96 average wage at placement.  With six more months remaining in this pilot, SETA and CAERC members are making great strides. \nAnother CAERC partner, Sacramento Public Library, has been serving a target population in the region though an online high school diploma program, as a result of the special project funds received by CAERC.  \nIn year 4, the consortium will continue and expand upon the efforts initiated in the first 3 years with the extended focus on Enhancing Services & Instruction. The consortium will work on the following strategies for 2018-19: \n1. Expand Adult Education Course Offerings in the 7 Program Areas in the Region.  \n2. Coordinate and Expand Marketing and Outreach Efforts  \n3. Use and Promote the Regional Asset Map  \n4. Align Courses Across the Consortium and Streamline Pathways for Adult Learners. \n5. Increase K-12 Adult Education Transition to Postsecondary Education, Training and/or Employment with Student Outreach Events and Services.  \n6. Expand Career Pathways Programming, Integrated Education & Training (IET) Offerings and Boot Camps Across the Region.  \n7. Offer Professional Development to Support the Regional Strategies.  \n8. Strengthen Regional Partnerships to Increase Funding and Leverage Existing Structures and Expertise to Benefit Adult Learners in our Region.  \n9. Support data collection and reporting efforts and data-driven decision making in and outside of the class."
	},
	{
		"institution_id" : 379,
		"description" : "The San Luis Obispo Adult Education Consortium (SLOCAEC) has made significant headway over the past three years as we continue to persist in the implementation of the Regional Comprehensive Plan (RCP). The consortium continues to work collaboratively amongst members and partners to coordinate and develop an integrated adult education system across local school districts and the community college by leveraging resources, developing seamless transitions, implementing innovative strategies, and shared professional development opportunities that will support both new and existing adult education students. The consortium has worked efficiently and effectively to develop programs and strategies that connect the adult learner with regional resources and social services that guide and assist them with their educational goals while mitigating barriers to their success.\nSLOCAEC has completed the restructure of existing programs, developed new programs, modified curriculum, and implemented supportive services to improve student success, accelerate learning, and increase successful course completion. Strategies to improve retention and persistence were implemented with success and noncredit counselors were hired at the Community College to assist with this strategy and process. Counseling at K-12 Adult Schools is imbedded into each student's individualized educational goals. \nAdministrators, faculty, and staff attended various professional development opportunities with an emphasis on adult education and retention to provide input and identify best practices and strategies for our region's adult education learner.\nEfforts continue to be made to leverage resources and close gaps in services and achievement gaps for students enrolled in adult education programs. K-12 districts have aligned curriculum and are developing Short-term Career Technical Education (CTE) programs. Cuesta College has increased the number of noncredit Career Development College Preparation (CDCP) programs with an emphasis on Short-Term CTE and Workforce Preparation with a high employability outcome. All districts have established a process that continues to develop and improve with America’s Job Center of California (AJCC) to ensure students are connected with employability opportunities that are in high demand in the San Luis Obispo County. \nSLOCAEC is proud to report that it has continued to persist to reach the vision and goals of the Regional Comprehensive Plan. \n"
	},
	{
		"institution_id" : 397,
		"description" : "NCAEC works with stakeholders and partners to provide educational programs and services that prepare students to successfully transition to careers.  NCAEC's 2018-2019 annual plan activities focus on continuing collaborative efforts to improve adult learner access to high quality educational opportunities and career pathway support services. This year’s plan builds upon the accomplishments of 2017/2018 and will align with the consortium's upcoming 3-year plan.  For 2018-2019, NCAEC will continue to coordinate and develop an integrated adult education system across local school districts and the community college by leveraging resources, developing seamless transitions, implementing innovative strategies, and shared professional development opportunities that will support both new and existing adult education students. The consortium has worked efficiently and effectively and will continue to develop programs and strategies that connect the adult learner with regional resources and social services that guide and assist them with their educational goals while mitigating barriers to their success. NCAEC has developed new programs, modified curriculum, and implemented supportive services to improve student success, accelerate learning, and increase successful course completion.  NCAEC has and will continue to leverage funds to increase programs and services to students, increase access to programs through distance education platforms, and to increase the number of career opportunities through the development of short-term CTE programs.\n\n\n"
	},
	{
		"institution_id" : 368,
		"description" : "The Pasadena Area Consortium remains committed to providing lead programmatic, instructional opportunities that are designed to provided opportunities for adult learners to advance in current employment and/or to help them gain new skill sets to move into living waged employment. Across the past three years, the consortium has provided programs and services to our communities and we have recently undergone a period of assessment to refine and better determine the most strategically appropriate job sectors for continued and future activities. We maintain the the vision of engaging with businesses and advisory groups to align our collective endeavors with key, workforce sectors in which forecasted job opportunities remain high for the  future; most notably in the key sectors of Hospitality/Tourism, Pre-Apprenticeship Building and inspection, Health Care, and other key service-based industries sectors. \n\nConsortium members continue to work closely with business and industry advisory committees and other business partners to create more on-the-job internship opportunities for individuals. The path forward for adults to enter into and complete increased short-term workforce certificate program opportunities remains a lead outcome for the consortium members. Specific work with K-12 Outward Bound Adventures and other community based groups will be targeted towards future Workforce Skill Development for leading to in -demand, careers in environmental conservation.\nFurther, to meet the challenge of marketing to get the information to the community, specific CTE program brochures identifying training and educational opportunities have been developed and disseminated. Program opportunities are scheduled at various school sites throughout Pasadena area.\n\n\n"
	},
	{
		"institution_id" : 340,
		"description" : "The Morongo Basin Adult Education Consortium is composed of the one community college district (Copper Mountain Community College District) and the one K-12 school district (Morongo Unified School District) in the geographic boundaries of our consortium area. We utilize a collaborative approach that includes a Community Advisory Board, representing various nonprofit entities in our area that serve youth and adults through their public and social services agencies as well as educators from both the community college and school district. CMCCD and MUSD continue to have conversations about offering career pathways for both our recent high school graduates as well as older adults.  \n"
	},
	{
		"institution_id" : 385,
		"description" : "Within the 18/19 program year, The Shasta-Tehama-Trinity Adult Education Consortium dba Better.Jobs will continue to provide adult education services based on the needs of the region. Each year we continue expanding, exploring and implementing new ways to provide adult education and employment needs for adults from all walks of life. Members of the consortium through ongoing partnerships will continue to help adults improve literacy skills, complete their high school diploma or their recognized equivalents, complete post-secondary certificates, degrees or training programs, find employment, increase their wages, transition to post-secondary pathways and/or provide courses focused in helping parents, guardians and mentors offer children support and guidance in academic success. \nGoal completion is essential to our regional team because many adults start but don't finish for a variety of reasons.  \nThrough continued integrated academic programs, partnerships, increased communication, shared student data and referral information, expansion of support services and shared professional development, our consortia has already experienced adults completing goals and benefiting from AB104 performance outcomes.\nBecause the demands of ABE, CTE and ESL courses are high within our region, our consortium has primarily focused on solidifying current programs. This has proven to be successful. More than 50% of adults seeking ABE and CTE courses throughout our consortium successfully complete and obtain a high school diploma, equivalent and/or certificate. Depending on the goal of the adult, some may even transition from non-credit CTE classes to credit CTE courses through Shasta College. After completion at the community college, industry recognized certificates are attainable through credit bearing courses. Whether non-credit or credit, positive outcomes are met by helping adults enter employment and sometimes helping those currently employed receive wage increases. Partnerships have been made with local businesses through current AEBG CTE programs, creating long term partnerships and sustainability for the future workforce. \nWithin the year an increase of English Language Learners have shown interest and dedication to their ESL classes. ESL classes have been expanded this year (Shasta and Tehama counties) because of the high percentage of ELL seeking ESL classes and continued expansion is needed within Trinity county possibly offered at the county office of education. \n\n"
	},
	{
		"institution_id" : 330,
		"description" : "Barstow Area Consortium for Adult Education (BACAE) holds Members to a spirit of collaboration in all decision making. The Regional Comprehensive Plan submitted in March 2015 serves as a foundational plan for the Consortium toward the realization of the vision and goals keeping in alignment with the county’s vision of working together to create regional stability among Adult Education providers.\n\nBACAE is located in California’s High Desert, and covers mostly rural geography. The economic development plan of the county does not address the specific needs of the Consortium. With a renewed commitment to the AEBG initiative, the 2017-18 plan was developed to bring BACAE into alignment with AB104 legislation, and move the adult education programs in the region forward in a spirit of collaboration and partnership.\n\nDuring the 2018-19 fiscal year, BACAE will primarily address gaps in service and seamless transitions. Additionally, the Consortium will deploy methods to support accelerated learning programs for students in their academic pathways and/or career goals. The Consortium will work on building relationships with more community partners to leverage existing resources. To address the needs of rural areas, BACAE will develop and implement a Distance Learning policy.\n\nBACAE will offer professional development across the AEP Program Areas includes training on the CCR Standards, Andragogical Methodologies of Instruction, Technology in the Adult Education Classroom, and WIOA/AEP. Member Districts will encourage faculty and staff to attend regional, state and national conferences as a means of forming peer relations with other education professionals and developing professional teaching competencies.\n\nAll members will engage in renewed efforts to increase transitions between adult education programs and for successful transition to Barstow Community College. Lastly, BACAE Members will begin the process of WASC Accreditation as a precursor for applying for WIOA funds, in full recognition of the importance of braided/blended funding. While this might not be possible for every Member, the BACAE Board commits to exploring options to increase the rigor and credibility of all programs across the Consortium."
	}
]
